[
  {
    "ok": true,
    "title": "Star Wars: Squadrons",
    "pageid": 64262611,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Squadrons",
    "extract": "Star Wars: Squadrons is a space combat game set in the Star Wars universe, developed by Motive Studio and published by Electronic Arts. It was released for PlayStation 4, Windows, and Xbox One, on October 2, 2020, and for Xbox Series X/S on December 3, 2020. The game features both multiplayer game modes and a single-player campaign. Set after Return of the Jedi, the campaign alternates between the New Republic's Vanguard Squadron and the Galactic Empire's Titan Squadron, both of which become involved with the Republic's Project Starhawk; Vanguard Squadron wants to ensure its completion, while Titan Squadron attempts to destroy it.\nThe game received generally favorable reviews upon release, garnering praise for its gameplay, while facing some criticism over its story and lack of content. The game sold more than 1.1 million digital copies as of October 2020.\n\n",
    "categories": [
      "Category:2020 video games",
      "Category:Action games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Electronic Arts games",
      "Category:Frostbite (game engine) games",
      "Category:Motive Studio games",
      "Category:Multiplayer and single-player video games",
      "Category:PlayStation 4 games",
      "Category:Short description is different from Wikidata",
      "Category:Space combat simulators",
      "Category:Space opera video games",
      "Category:Star Wars video games",
      "Category:Use mdy dates from December 2020",
      "Category:Video games developed in Canada",
      "Category:Video games set in outer space",
      "Category:Virtual reality games",
      "Category:Windows games",
      "Category:Xbox One games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: Squadrons</i>",
      "page_image": "Star_Wars_Squadrons.jpg",
      "wikibase-shortdesc": "2020 video game",
      "wikibase_item": "Q96312725"
    },
    "requested_title": "Another Cockpit",
    "resolved_title": "Star Wars: Squadrons"
  },
  {
    "ok": true,
    "title": "Star Wars (1991 video game)",
    "pageid": 1563133,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_(1991_video_game)",
    "extract": "Star Wars is an action-platform video game based on the 1977 film of the same name. It was released by Victor Musical Industries for the Family Computer in Japan on November 15, 1991, and by JVC Musical Industries for the Nintendo Entertainment System in North America in November 1991, and in Europe on March 26, 1992. An official mail order \"Hint Book\" was available for the game upon its release.\nTwo versions for handheld game consoles were released. The Game Boy port was developed by NMS Software and published by Capcom, and released shortly less than a year later in 1992. The Game Gear port was developed by Tiertex and published by U.S. Gold, and released in 1993. A Master System version was also released, which was also developed by Tiertex. The game was followed by Star Wars: The Empire Strikes Back in 1992. An NES game adaptation of Return of the Jedi never came into fruition. A counterpart of the game for the Super NES, titled Super Star Wars, was released in 1992. On June 28, 2019, the NES and Game Boy versions of Star Wars were re-released as part of both standard and \"Collector's Edition\" sets in limited quantities on unlicensed replica game cartridges by Limited Run Games.",
    "categories": [
      "Category:1991 video games",
      "Category:All articles with unsourced statements",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from September 2024",
      "Category:Beam Software games",
      "Category:Capcom games",
      "Category:Game Boy games",
      "Category:Game Gear games",
      "Category:LucasArts games",
      "Category:Master System games",
      "Category:NMS Software games",
      "Category:Nintendo Entertainment System games",
      "Category:Platformers",
      "Category:Short description matches Wikidata",
      "Category:Single-player video games",
      "Category:Star Wars (film) video games",
      "Category:Tiertex Design Studios games",
      "Category:U.S. Gold games",
      "Category:Ubisoft games",
      "Category:Victor Entertainment games",
      "Category:Video games developed in Australia",
      "Category:Video games featuring female protagonists"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i> (1991 video game)",
      "page_image": "JVC_Star_Wars.jpg",
      "wikibase-shortdesc": "1991 video game",
      "wikibase_item": "Q54320"
    },
    "requested_title": "Asteroid Cave",
    "resolved_title": "Star Wars (1991 video game)"
  },
  {
    "ok": false,
    "requested_title": "Barge Observation Deck",
    "resolved_title": "Roll-on/roll-off",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": false,
    "requested_title": "Battlefield",
    "resolved_title": "Battlefield 1942",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": true,
    "title": "Star Wars: From the Adventures of Luke Skywalker",
    "pageid": 4936526,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_From_the_Adventures_of_Luke_Skywalker",
    "extract": "Star Wars: From the Adventures of Luke Skywalker is the novelization of the 1977 film Star Wars, ghostwritten by American author Alan Dean Foster, but credited to director George Lucas. It was first published on November 12, 1976, by Ballantine Books, several months before the release of the film. In later years, it was republished under the title Star Wars: A New Hope to reflect the retroactive addition of a subtitle to the film in 1981.\nThe prologue includes references to Palpatine and his rise to power, setting up the backstory for future films. The book also contains some differences from the film.",
    "categories": [
      "Category:1976 American novels",
      "Category:1976 science fiction novels",
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from May 2020",
      "Category:Ballantine Books books",
      "Category:Novels based on films",
      "Category:Novels by Alan Dean Foster",
      "Category:Novels set in deserts",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars (film)",
      "Category:Star Wars novels",
      "Category:Use mdy dates from December 2015"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: From The Adventures Of Luke Skywalker",
      "displaytitle": "<i>Star Wars: From the Adventures of Luke Skywalker</i>",
      "page_image": "StarWarsNovelization.jpg",
      "wikibase-shortdesc": "1976 novel by Alan Dean Foster",
      "wikibase_item": "Q6272668"
    },
    "requested_title": "Biggs' Cockpit",
    "resolved_title": "Star Wars: From the Adventures of Luke Skywalker"
  },
  {
    "ok": true,
    "title": "Anthony Daniels",
    "pageid": 622597,
    "fullurl": "https://en.wikipedia.org/wiki/Anthony_Daniels",
    "extract": "Anthony Daniels ( AN-tə-nee; born 21 February 1946) is an English actor and mime artist, best known for playing C-3PO in 11 Star Wars films,  from Star Wars (1977) to Star Wars: The Rise of Skywalker (2019). He wore the costume and voiced his character in the films and several animated television series.\nHe is the only actor to have either appeared in or been involved with all theatrical films in the series, and has been involved in many of their spin-offs, including television series, video games, and radio serials. His other roles included CZ-3 in Star Wars, Tak in Solo: A Star Wars Story and more. Daniels also portrayed C-3PO in several commercials, non-canon films including The Lego Movie and non-canon television shows including The Muppet Show. Outside the films, he has narrated and hosted some documentaries (starting off with the 1977 television special, The Making of Star Wars and later Science of Star Wars) and has hosted several events including Star Wars: In Concert since 2009. His involvement in the franchise and association with his character from meeting film director George Lucas in November 1975 to wrapping up on The Rise of Skywalker has been detailed in his 2019 memoirs, I Am C-3PO: The Inside Story.\nPrior to his involvement in the franchise, Daniels appeared in several theatrical productions including Rosencrantz and Guildenstern Are Dead. He was the voice of Legolas in the Ralph Bakshi animated adaptation of The Lord of the Rings (1978). He has appeared intermittently on British television in various dramas, including playing a pathologist in Prime Suspect starring Helen Mirren. Daniels was an adjunct professor at Carnegie Mellon University's Entertainment Technology Center.",
    "categories": [
      "Category:1946 births",
      "Category:20th-century English male actors",
      "Category:21st-century English male actors",
      "Category:All Wikipedia articles written in British English",
      "Category:Alumni of Rose Bruford College",
      "Category:Articles with hCards",
      "Category:Articles with short description",
      "Category:Audiobook narrators",
      "Category:British mimes",
      "Category:Carnegie Mellon University faculty",
      "Category:Commons category link is on Wikidata",
      "Category:English male film actors",
      "Category:English male television actors",
      "Category:English male voice actors",
      "Category:Harv and Sfn no-target errors",
      "Category:Living people",
      "Category:Male actors from Salisbury",
      "Category:People educated at Giggleswick School",
      "Category:Short description is different from Wikidata",
      "Category:TCMDb name template using non-numeric ID from Wikidata",
      "Category:Use British English from July 2022",
      "Category:Use dmy dates from October 2020"
    ],
    "pageprops": {
      "defaultsort": "Daniels, Anthony",
      "page_image_free": "Anthony_Daniels_2011.jpg",
      "wikibase-shortdesc": "English actor and mime artist (born 1946)",
      "wikibase_item": "Q441685"
    },
    "requested_title": "Boiler Room",
    "resolved_title": "Anthony Daniels"
  },
  {
    "ok": true,
    "title": "Star Wars Jedi Knight II: Jedi Outcast",
    "pageid": 48687,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Jedi_Knight_II:_Jedi_Outcast",
    "extract": "Star Wars Jedi Knight II: Jedi Outcast is a 2002 first and third-person shooter video game developed by Raven Software for Windows and Mac OS. Westlake Interactive ported the game to Mac OS X, while the Xbox and GameCube versions were ported by Vicarious Visions; most versions were published by Activision and LucasArts, with only the Mac OS version published by Aspyr. The game is a sequel to 1997's Star Wars Jedi Knight: Dark Forces II, and the third main installment in the Star Wars: Jedi Knight series. The single-player campaign, set in the fictional Star Wars expanded universe two years after the Mysteries of the Sith expansion for Dark Forces II, follows returning protagonist Kyle Katarn, a mercenary working for the New Republic and former Jedi who cut his connection to the Force. Katarn must return to his Jedi ways to stop a branch of the Imperial Remnant led by the Dark Jedi Desann from empowering their army with the Force.\nJedi Outcast was developed using a more powerful game engine, id Tech 3. The hack and slash combat introduced in Dark Forces II was heavily reworked, becoming the main focus of the gameplay instead of the shooter elements, which are prominent only during the first few missions of the game. Players may wield blasters, lightsabers, and Force powers to engage enemies, with the latter being recommended in later stages of the game, as numerous lightsaber-wielding enemies are introduced. Jedi Outcast also features a multiplayer mode that allows players to compete in several different game modes online or over a local area network.\nUpon release, the game received universal acclaim from critics, with its story and lightsaber combat being the main praised elements. A sequel and the final installment in the Jedi Knight series, Star Wars Jedi Knight: Jedi Academy, was released in 2003. In September 2009, the game was re-released onto Steam and Direct2Drive alongside the rest of the Jedi Knight series. A Nintendo Switch and PlayStation 4 port with no multiplayer mode was released in September 2019. In 2021, Jedi Outcast was made backwards compatible on Xbox One and Xbox Series X/S.",
    "categories": [
      "Category:2002 video games",
      "Category:Activision games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in multiple platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Aspyr games",
      "Category:CS1 French-language sources (fr)",
      "Category:CS1 German-language sources (de)",
      "Category:Classic Mac OS games",
      "Category:Commercial video games with freely available source code",
      "Category:First-person shooters",
      "Category:GameCube games",
      "Category:Id Tech 3 games",
      "Category:LucasArts games",
      "Category:MacOS games",
      "Category:Multiplayer and single-player video games",
      "Category:Multiplayer online games",
      "Category:Nintendo Switch games",
      "Category:Open-source video games",
      "Category:PlayStation 4 games",
      "Category:Raven Software games",
      "Category:Sequel video games",
      "Category:Short description matches Wikidata",
      "Category:Star Wars: Jedi Knight",
      "Category:Third-person shooters",
      "Category:Use mdy dates from August 2013",
      "Category:Vicarious Visions games",
      "Category:Video games developed in the United States",
      "Category:Westlake Interactive games",
      "Category:Windows games",
      "Category:Xbox games"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Jedi Knight Ii: Jedi Outcast",
      "displaytitle": "<i>Star Wars Jedi Knight II: Jedi Outcast</i>",
      "page_image": "Jedi_Outcast_pc_cover.jpg",
      "wikibase-shortdesc": "2002 video game",
      "wikibase_item": "Q55298"
    },
    "requested_title": "Bottom Of Cloud City",
    "resolved_title": "Star Wars Jedi Knight II: Jedi Outcast"
  },
  {
    "ok": false,
    "requested_title": "Bunker",
    "resolved_title": "Bunker",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": true,
    "title": "Star Wars: Episode I – The Phantom Menace",
    "pageid": 50793,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Episode_I_%E2%80%93_The_Phantom_Menace",
    "extract": "Star Wars: Episode I – The Phantom Menace is a 1999 American epic space opera film written and directed by George Lucas in his first directorial effort since the original Star Wars, released in 1977. Produced by Lucasfilm and distributed by 20th Century Fox, it is the fourth film in the Star Wars film series, the first film of the prequel trilogy and the first chronological chapter of the \"Skywalker Saga\". The film stars Liam Neeson, Ewan McGregor, Natalie Portman, Jake Lloyd, Ahmed Best, Ian McDiarmid, Anthony Daniels, Kenny Baker, Pernilla August, and Frank Oz. It is set 32 years before the original trilogy (13 years before the formation of the Galactic Empire), during the era of the Galactic Republic.\nThe film follows Jedi Master Qui-Gon Jinn and his apprentice Obi-Wan Kenobi as they try to protect Padmé Amidala of Naboo in her mission to resolve an interplanetary trade dispute. They also confront the mysterious return of the Sith with the Force-sensitive young slave Anakin Skywalker joining their efforts. \nFollowing the release of Return of the Jedi (1983), talks of a follow-up were proposed, but Lucas was not motivated to return to the franchise. During the hiatus, the backstories he created for the characters, particularly Anakin's, sparked interest in him to develop a prequel trilogy during the 1990s. After he determined that computer-generated imagery (CGI) had advanced to the level he wanted for the prequel trilogy's visual effects, Lucas began writing The Phantom Menace in 1993, and production began in 1994. Filming started in June 1997—at locations at Leavesden Film Studios, at the Royal Palace of Caserta in Italy and the Tunisian desert—and ended in September.\nThe Phantom Menace was released in theaters on May 19, 1999, almost 16 years after the premiere of Return of the Jedi. The film's premiere was extensively covered by media and was widely anticipated because of the large cultural following the Star Wars saga had cultivated. Upon its release, The Phantom Menace received mixed reviews from critics. While the visual effects were praised, criticism was largely focused on its exposition and characters—particularly Jar Jar Binks.\nThe film was a box-office success and broke numerous records. It grossed $924 million worldwide during its initial theatrical run, becoming the highest-grossing film of 1999, the second-highest-grossing film of all-time, and the third-highest in North America (behind Titanic and Star Wars), as well as the highest-grossing Star Wars film at the time (not factoring in inflation). The film has been re-released several times, including a 2012 3D reissue which brought its overall worldwide gross to over $1 billion. Attack of the Clones (2002) and Revenge of the Sith (2005) followed The Phantom Menace, rounding out the Star Wars prequel trilogy.",
    "categories": [
      "Category:1990s American films",
      "Category:1990s English-language films",
      "Category:1990s science fiction adventure films",
      "Category:1990s science fiction war films",
      "Category:1999 films",
      "Category:1999 science fiction action films",
      "Category:1999 science fiction films",
      "Category:20th Century Fox films",
      "Category:3D re-releases",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles containing potentially dated statements",
      "Category:American epic fantasy films",
      "Category:American films about revenge",
      "Category:American prequel films",
      "Category:American science fantasy films",
      "Category:American science fiction action films",
      "Category:American science fiction war films",
      "Category:Articles containing potentially dated statements from August 2017",
      "Category:Articles with hAudio microformats",
      "Category:Articles with short description",
      "Category:CS1 Portuguese-language sources (pt)",
      "Category:English-language science fiction action films",
      "Category:English-language science fiction adventure films",
      "Category:English-language war films",
      "Category:Films about alien invasions",
      "Category:Films about children",
      "Category:Films about elections",
      "Category:Films about slavery",
      "Category:Films directed by George Lucas",
      "Category:Films produced by Rick McCallum",
      "Category:Films scored by John Williams",
      "Category:Films set underwater",
      "Category:Films shot at Warner Bros. Studios Leavesden",
      "Category:Films shot in Hertfordshire",
      "Category:Films shot in Italy",
      "Category:Films shot in Sydney",
      "Category:Films shot in Tunisia",
      "Category:Films using motion capture",
      "Category:Films with screenplays by George Lucas",
      "Category:Golden Raspberry Award–winning films",
      "Category:Good articles",
      "Category:IMDb ID (Cite Mojo) different from Wikidata",
      "Category:Lucasfilm films",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Pages with non-numeric formatnum arguments",
      "Category:Puppet films",
      "Category:Race-related controversies in film",
      "Category:Saturn Award–winning films",
      "Category:Short description is different from Wikidata",
      "Category:Spoken articles",
      "Category:Star Wars: Episode I – The Phantom Menace",
      "Category:Star Wars Skywalker Saga films",
      "Category:Template film date with 2 release dates",
      "Category:Underwater civilizations in fiction",
      "Category:Use American English from September 2019",
      "Category:Use mdy dates from September 2019",
      "Category:Webarchive template wayback links"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Episode 1: The Phantom Menace",
      "displaytitle": "<i>Star Wars: Episode I – The Phantom Menace</i>",
      "page_image": "Star_Wars_Phantom_Menace_poster.jpg",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "1999 film by George Lucas",
      "wikibase_item": "Q165713"
    },
    "requested_title": "Chief's Hut",
    "resolved_title": "Star Wars: Episode I – The Phantom Menace"
  },
  {
    "ok": true,
    "title": "Cloud City",
    "pageid": 17728957,
    "fullurl": "https://en.wikipedia.org/wiki/Cloud_City",
    "extract": "Cloud City may refer to:\n\nFloating city (science fiction)\nCloud City, a floating city on the planet Bespin in the Star Wars universe\nCloud City, a nickname for Allianz Field, a soccer stadium in Saint Paul, Minnesota, inspired by its broadly similar appearance to the Star Wars location and as a reference to the team's long-standing supporter's group, the Dark Clouds\nCloud City, a dream location in an episode of the animated miniseries Over the Garden Wall\nThe Cloud City Miners' Union, the group which initiated the Leadville Miners' strike in the 1890s",
    "categories": [
      "Category:All article disambiguation pages",
      "Category:All disambiguation pages",
      "Category:Disambiguation pages",
      "Category:Short description is different from Wikidata"
    ],
    "pageprops": {
      "disambiguation": "",
      "wikibase-shortdesc": "Topics referred to by the same term",
      "wikibase_item": "Q23905241"
    },
    "requested_title": "Cloud City",
    "resolved_title": "Cloud City"
  },
  {
    "ok": true,
    "title": "Star Wars: The Acolyte",
    "pageid": 63774166,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_The_Acolyte",
    "extract": "The Acolyte, also known as Star Wars: The Acolyte, is an American science fiction television series created by Leslye Headland for the streaming service Disney+. It is part of the Star Wars franchise, set at the end of the High Republic era before the events of the Skywalker Saga, and follows a Jedi investigation into a series of crimes.\nAmandla Stenberg, Lee Jung-jae, Charlie Barnett, Dafne Keen, Rebecca Henderson, Jodie Turner-Smith, Carrie-Anne Moss, Manny Jacinto, Dean-Charles Chapman, Joonas Suotamo, Margarita Levieva, Lauren Brady, Leah Brady, Harry Trevaldwyn, and David Harewood star in the series. Headland expressed interest in working on the Star Wars franchise by the end of 2019, and was developing a new series for Lucasfilm by April 2020. She wanted to explore the franchise from the perspective of the villains. The title was announced in December 2020. Filming took place at Shinfield Studios in Berkshire from October 2022 to June 2023, with location filming in Wales and Portugal.\nThe Acolyte premiered on Disney+ with its first two episodes on June 4, 2024. The other six episodes were released weekly through July 16. Reviews by critics were generally favorable. The series, which divided fans of the franchise, became the subject of a review bombing campaign and received lower viewership than previous Star Wars series. It was canceled in August 2024 due to low viewership and going over budget. The series received several accolades including a Primetime Creative Arts Emmy Award nomination.",
    "categories": [
      "Category:2020s American LGBTQ-related drama television series",
      "Category:2020s American drama television series",
      "Category:2020s American science fiction television series",
      "Category:2024 American television series debuts",
      "Category:2024 American television series endings",
      "Category:All Wikipedia articles written in American English",
      "Category:American English-language television shows",
      "Category:American action adventure television series",
      "Category:Articles with short description",
      "Category:CS1 European Portuguese-language sources (pt-pt)",
      "Category:CS1 Portuguese-language sources (pt)",
      "Category:Disney+ original programming",
      "Category:Disney and LGBTQ",
      "Category:LGBTQ speculative fiction television series",
      "Category:Live action television shows based on films",
      "Category:Pages using infobox television with non-matching title",
      "Category:Productions using StageCraft",
      "Category:Short description is different from Wikidata",
      "Category:Space adventure television series",
      "Category:Star Wars: The High Republic",
      "Category:Star Wars television series",
      "Category:Television series about twins",
      "Category:Television shows filmed in England",
      "Category:Television shows filmed in Portugal",
      "Category:Television shows filmed in Wales",
      "Category:Use American English from August 2024",
      "Category:Use list-defined references from August 2024",
      "Category:Use mdy dates from September 2025"
    ],
    "pageprops": {
      "defaultsort": "Acolyte (TV series), The",
      "displaytitle": "<i>Star Wars: The Acolyte</i>",
      "page_image_free": "The_Acolyte_Logo.jpg",
      "wikibase-shortdesc": "American television series",
      "wikibase_item": "Q104161310"
    },
    "requested_title": "Creature's House",
    "resolved_title": "Star Wars: The Acolyte"
  },
  {
    "ok": true,
    "title": "Dagobah",
    "pageid": 56295,
    "fullurl": "https://en.wikipedia.org/wiki/Dagobah",
    "extract": "Dagobah is a fictional planet and eponymous star system appearing in the Star Wars films The Empire Strikes Back, Return of the Jedi, and Revenge of the Sith, and other media. It is depicted as a world of murky swamps, steaming bayous, and jungles, resembling Earth during the Carboniferous period. Dagobah is 14,410 kilometers in diameter with an orbital period of 341 days. Dagobah's climate and atmosphere consists of two seasons: a dry season, where the uplands become too hot for most life forms to survive; and a wet season, consisting of violent lightning storms, dense fog, and long periods of torrential rainfall. The Tash were a sentient species native to Dagobah.\nThe Dagobah System lies within the Dagobah subsector of the Sluis sector, located in the Outer Rim Territories galactic quadrant region, 50,250 light-years from Coruscant. The sun was called Dagobah Prime. It is noted as being one of the purest places in the galaxy, incredibly strong in the living force, and being chosen by Jedi Yoda as the planet to go into exile on to mask his presence and avoid discovery by the Galactic Empire.",
    "categories": [
      "Category:All articles needing additional references",
      "Category:All articles with unsourced statements",
      "Category:Articles needing additional references from May 2019",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from May 2019",
      "Category:CS1 German-language sources (de)",
      "Category:Fictional elements introduced in 1980",
      "Category:Fictional planets",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars planets"
    ],
    "pageprops": {
      "page_image": "Dagobah.jpg",
      "wikibase-shortdesc": "Fictional planet in the Star Wars saga",
      "wikibase_item": "Q848609"
    },
    "requested_title": "Dagobah",
    "resolved_title": "Dagobah"
  },
  {
    "ok": true,
    "title": "Star Wars original trilogy",
    "pageid": 1551789,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_original_trilogy",
    "extract": "The original Star Wars trilogy, formerly marketed as the Star Wars Trilogy (and colloquially referred to as the 'original trilogy' or classic trilogy), is the first set of three films produced in the Star Wars franchise, an American space opera created by George Lucas. It was produced by Lucasfilm and distributed by 20th Century Fox, and consists of Star Wars (1977), The Empire Strikes Back (1980) and Return of the Jedi (1983). Beginning in medias res, the original trilogy serves as the second act of the nine-episode Skywalker Saga. It was followed by a prequel trilogy between 1999 and 2005, and a sequel trilogy between 2015 and 2019. Collectively, they are referred to as the \"Skywalker Saga\" to distinguish them from spin-off films set within the same universe.\nThe films center on the Galactic Civil War between the Rebel Alliance and the tyrannical Galactic Empire, as well as the archetypical hero's journey of Luke Skywalker in his quest to become a Jedi under the tutelage of exiled Jedi Masters Obi-Wan Kenobi and Yoda. Luke joins forces with Princess Leia, Han Solo, Chewbacca, C-3PO, R2-D2 and the Rebel Alliance in facing the Empire and the evil Sith Lord Darth Vader.\nThe original Star Wars film received widespread acclaim from critics for its storytelling, characters, John Williams' musical score and its groundbreaking visual and sound effects. The film surpassed 1975's Jaws as the highest grossing film of all time, turning science fiction films into a blockbuster genre, until it was surpassed by E.T. the Extra-Terrestrial in 1982. Star Wars and The Empire Strikes Back have been hailed as among the greatest and most important films of all time. Since the original trilogy's release and success, Star Wars has become a pop culture phenomenon, spawning a multimedia franchise, consisting of countless TV series, video games, books and theme park attractions, complete with a multi-million dollar merchandising empire. All three films have been inducted by the Library of Congress for preservation in the United States National Film Registry for being \"culturally, historically, or aesthetically significant\".\n\n",
    "categories": [
      "Category:20th Century Fox films",
      "Category:All Wikipedia articles written in American English",
      "Category:American film series",
      "Category:Articles with short description",
      "Category:Film series introduced in 1977",
      "Category:Lucasfilm films",
      "Category:Pages using infobox film with nonstandard dates",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars Skywalker Saga films",
      "Category:Use American English from September 2019",
      "Category:Use mdy dates from October 2024",
      "Category:Webarchive template wayback links"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i> original trilogy",
      "wikibase-shortdesc": "First three films in the media franchise",
      "wikibase_item": "Q25540859"
    },
    "requested_title": "Dagobah Swamp",
    "resolved_title": "Star Wars original trilogy"
  },
  {
    "ok": true,
    "title": "Journey to Star Wars",
    "pageid": 48870709,
    "fullurl": "https://en.wikipedia.org/wiki/Journey_to_Star_Wars",
    "extract": "\"Journey to Star Wars\" is a Disney/Lucasfilm publishing initiative that connects the Star Wars sequel films with previous film installments in the franchise. It currently includes the initiatives \"Journey to Star Wars: The Force Awakens\", and \"Journey to Star Wars: The Last Jedi\", and \"Journey to Star Wars: The Rise of Skywalker\". All titles under the program are canonical to the\nStar Wars universe.\nA group of \"at least\" 20 novels and comic books related to the 2015 film Star Wars: The Force Awakens was announced in March 2015. The first novels, including Star Wars: Aftermath and Star Wars: Lost Stars,\nwere published in September 2015, prior to the release of\nThe Force Awakens in December 2015.\nThree novels and a comic miniseries related to the 2017 film Star Wars: The Last Jedi were announced in April 2017. Two novels, a comic miniseries, and a number of children's books related to the 2019 film Star Wars: The Rise of Skywalker were announced in May 2019.",
    "categories": [
      "Category:Articles with short description",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars",
      "Category:Star Wars novels"
    ],
    "pageprops": {
      "defaultsort": "Journey To Star Wars",
      "displaytitle": "Journey to <i>Star Wars</i>",
      "toc": "",
      "wikibase-shortdesc": "Disney/Lucasfilm book series",
      "wikibase_item": "Q22906023"
    },
    "requested_title": "Darth Vader's Cockpit",
    "resolved_title": "Journey to Star Wars"
  },
  {
    "ok": true,
    "title": "Death Star",
    "pageid": 53888,
    "fullurl": "https://en.wikipedia.org/wiki/Death_Star",
    "extract": "The Death Star is a fictional space station and superweapon featured in the Star Wars space-opera franchise. Constructed by the autocratic Galactic Empire, the Death Star is capable of obliterating entire planets, and serves to enforce the Empire's reign of terror. Appearing in the original film Star Wars (1977), the Death Star serves as the central plot point and setting for the film, and is destroyed in an assault by the Rebel Alliance during the climax of the film, with the prequel film Rogue One (2016) and the television series Andor (2022–2025) exploring its construction. A larger second Death Star is being built in the events of the film Return of the Jedi (1983), featuring substantially improved capabilities compared to its predecessor, before it is destroyed by the Rebel Alliance while under construction.\nSince its first appearance, the Death Star has become a cultural icon and a widely recognized element of the Star Wars franchise. It inspired numerous similar superweapons in fiction as well as in other Star Wars works. The film The Force Awakens (2015) introduces Starkiller Base, a planet (Ilum) converted by the First Order into a Death Star-like superweapon. While more powerful and technologically advanced than both Death Stars, it is also destroyed by the Resistance. The film The Rise of Skywalker  (2019) introduces the Final Order, a massive fleet of Xyston-class Star Destroyers built by the Sith Eternal, individual warships each carrying \"planet-killing\" weapons; the film also features the remains of the second Death Star, on the ocean moon of Kef Bir.\n\n",
    "categories": [
      "Category:All Wikipedia articles written in American English",
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from February 2018",
      "Category:Articles with unsourced statements from June 2017",
      "Category:CS1 French-language sources (fr)",
      "Category:Fiction about megastructures",
      "Category:Fictional doomsday devices",
      "Category:Fictional elements introduced in 1977",
      "Category:Fictional energy weapons",
      "Category:Fictional space stations",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars locations",
      "Category:Star Wars spacecraft",
      "Category:Star Wars weapons",
      "Category:Use American English from November 2025",
      "Category:Use mdy dates from August 2023",
      "Category:Weapons of mass destruction in fiction",
      "Category:Webarchive template wayback links",
      "Category:Wikipedia articles needing page number citations from April 2019",
      "Category:Wikipedia articles needing page number citations from April 2020",
      "Category:Wikipedia indefinitely move-protected pages"
    ],
    "pageprops": {
      "page_image": "Death_star1.png",
      "wikibase-shortdesc": "Fictional moon-sized space station and superweapon",
      "wikibase_item": "Q19907"
    },
    "requested_title": "Death Star",
    "resolved_title": "Death Star"
  },
  {
    "ok": true,
    "title": "Star Wars Jedi Knight II: Jedi Outcast",
    "pageid": 48687,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Jedi_Knight_II:_Jedi_Outcast",
    "extract": "Star Wars Jedi Knight II: Jedi Outcast is a 2002 first and third-person shooter video game developed by Raven Software for Windows and Mac OS. Westlake Interactive ported the game to Mac OS X, while the Xbox and GameCube versions were ported by Vicarious Visions; most versions were published by Activision and LucasArts, with only the Mac OS version published by Aspyr. The game is a sequel to 1997's Star Wars Jedi Knight: Dark Forces II, and the third main installment in the Star Wars: Jedi Knight series. The single-player campaign, set in the fictional Star Wars expanded universe two years after the Mysteries of the Sith expansion for Dark Forces II, follows returning protagonist Kyle Katarn, a mercenary working for the New Republic and former Jedi who cut his connection to the Force. Katarn must return to his Jedi ways to stop a branch of the Imperial Remnant led by the Dark Jedi Desann from empowering their army with the Force.\nJedi Outcast was developed using a more powerful game engine, id Tech 3. The hack and slash combat introduced in Dark Forces II was heavily reworked, becoming the main focus of the gameplay instead of the shooter elements, which are prominent only during the first few missions of the game. Players may wield blasters, lightsabers, and Force powers to engage enemies, with the latter being recommended in later stages of the game, as numerous lightsaber-wielding enemies are introduced. Jedi Outcast also features a multiplayer mode that allows players to compete in several different game modes online or over a local area network.\nUpon release, the game received universal acclaim from critics, with its story and lightsaber combat being the main praised elements. A sequel and the final installment in the Jedi Knight series, Star Wars Jedi Knight: Jedi Academy, was released in 2003. In September 2009, the game was re-released onto Steam and Direct2Drive alongside the rest of the Jedi Knight series. A Nintendo Switch and PlayStation 4 port with no multiplayer mode was released in September 2019. In 2021, Jedi Outcast was made backwards compatible on Xbox One and Xbox Series X/S.",
    "categories": [
      "Category:2002 video games",
      "Category:Activision games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in multiple platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Aspyr games",
      "Category:CS1 French-language sources (fr)",
      "Category:CS1 German-language sources (de)",
      "Category:Classic Mac OS games",
      "Category:Commercial video games with freely available source code",
      "Category:First-person shooters",
      "Category:GameCube games",
      "Category:Id Tech 3 games",
      "Category:LucasArts games",
      "Category:MacOS games",
      "Category:Multiplayer and single-player video games",
      "Category:Multiplayer online games",
      "Category:Nintendo Switch games",
      "Category:Open-source video games",
      "Category:PlayStation 4 games",
      "Category:Raven Software games",
      "Category:Sequel video games",
      "Category:Short description matches Wikidata",
      "Category:Star Wars: Jedi Knight",
      "Category:Third-person shooters",
      "Category:Use mdy dates from August 2013",
      "Category:Vicarious Visions games",
      "Category:Video games developed in the United States",
      "Category:Westlake Interactive games",
      "Category:Windows games",
      "Category:Xbox games"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Jedi Knight Ii: Jedi Outcast",
      "displaytitle": "<i>Star Wars Jedi Knight II: Jedi Outcast</i>",
      "page_image": "Jedi_Outcast_pc_cover.jpg",
      "wikibase-shortdesc": "2002 video game",
      "wikibase_item": "Q55298"
    },
    "requested_title": "Detention Area",
    "resolved_title": "Star Wars Jedi Knight II: Jedi Outcast"
  },
  {
    "ok": true,
    "title": "Star Wars: Galactic Starcruiser",
    "pageid": 54565991,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Galactic_Starcruiser",
    "extract": "Star Wars: Galactic Starcruiser was a Star Wars-themed two-night live action role-playing/choose-your-own-adventure hotel experience operated by The Walt Disney Company from March 1, 2022, until September 30, 2023. It simulated a cruise in outer space within the Star Wars galaxy, and took place in a building located next to Disney's Hollywood Studios, in the Epcot Resort Area of the Walt Disney World Resort in Bay Lake, Florida. It was thematically linked to the Star Wars: Galaxy's Edge area in Disney's Hollywood Studios.\n\n",
    "categories": [
      "Category:2022 establishments in Florida",
      "Category:2023 disestablishments in Florida",
      "Category:All Wikipedia articles written in American English",
      "Category:Articles with short description",
      "Category:Commons category link from Wikidata",
      "Category:Coordinates on Wikidata",
      "Category:Defunct hotels in Florida",
      "Category:Hotel buildings completed in 2022",
      "Category:Hotels disestablished in 2023",
      "Category:Hotels established in 2022",
      "Category:Immersive entertainment",
      "Category:Live-action role-playing games",
      "Category:Pages using gadget WikiMiniAtlas",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars: Galaxy's Edge",
      "Category:Use American English from July 2023",
      "Category:Use mdy dates from July 2023",
      "Category:Webarchive template wayback links"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i>: Galactic Starcruiser",
      "page_image_free": "Atrium_at_Night_(52929319412).jpg",
      "wikibase-shortdesc": "Hotel at Walt Disney World (2022–23)",
      "wikibase_item": "Q33093155"
    },
    "requested_title": "Docking Bay",
    "resolved_title": "Star Wars: Galactic Starcruiser"
  },
  {
    "ok": true,
    "title": "List of Star Wars Legends characters",
    "pageid": 50106627,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_Legends_characters",
    "extract": "This is an incomplete list of characters from the Star Wars Expanded Universe, now rebranded Star Wars Legends. The accompanying works were declared non-canon to the Star Wars franchise by Lucasfilm in 2014.\nThis list applies only to characters who completely appear in Legends media, and who therefore do not exist in the canon continuity. For characters belonging to the canon continuity, see List of Star Wars characters.\n\n",
    "categories": [
      "Category:All articles needing additional references",
      "Category:All articles with dead external links",
      "Category:Articles needing additional references from February 2023",
      "Category:Articles with dead external links from April 2017",
      "Category:Articles with dead external links from December 2015",
      "Category:Articles with permanently dead external links",
      "Category:Articles with short description",
      "Category:Lists of Disney characters",
      "Category:Lists of science fiction characters",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars Legends characters",
      "Category:Star Wars character lists"
    ],
    "pageprops": {
      "defaultsort": "List Of Star Wars Characters",
      "displaytitle": "List of <i>Star Wars Legends</i> characters",
      "page_image_free": "Star_Wars_Yellow_Logo.svg",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q23808802"
    },
    "requested_title": "Docking Bay 94",
    "resolved_title": "List of Star Wars Legends characters"
  },
  {
    "ok": true,
    "title": "Star Wars: Battlefront",
    "pageid": 13957994,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Battlefront",
    "extract": "Star Wars: Battlefront is a series of first- and third-person shooter video games based on the Star Wars franchise. Players take the role of characters from the franchise in either of two opposing factions in different time periods of the Star Wars universe. The series was launched in 2004 by LucasArts with Star Wars: Battlefront, developed by Pandemic Studios for LucasArts. The game received positive reviews and sold well. In 2005 Pandemic developed a sequel, Star Wars: Battlefront II, which was also critically and commercially successful.\nThe games were followed by Star Wars Battlefront: Renegade Squadron (2007) and Star Wars Battlefront: Elite Squadron (2009) for handheld game consoles and Star Wars Battlefront: Mobile Squadrons (2009) for mobile devices. LucasArts made several attempts to develop a third major Battlefront game but no projects were released before The Walt Disney Company's acquisition of LucasArts. Subsequently, Electronic Arts (EA) acquired an exclusive license to develop console Star Wars titles from Lucasfilm, leading to the development of a reboot, titled Star Wars Battlefront from developer DICE, which was released on November 17, 2015. A sequel, Star Wars Battlefront II, was released on November 17, 2017, and was co-developed by EA DICE, Criterion Games, and Motive Studio. A collection of the first two entries in the original series ported to modern platforms by Aspyr, titled Star Wars: Battlefront Classic Collection, was released on March 14, 2024.\n\n",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from February 2024",
      "Category:Aspyr games",
      "Category:Electronic Arts franchises",
      "Category:Electronic Arts games",
      "Category:First-person shooters",
      "Category:Free Radical Design",
      "Category:LucasArts franchises",
      "Category:LucasArts games",
      "Category:Multiplayer online games",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Short description is different from Wikidata",
      "Category:Space opera video games",
      "Category:Star Wars: Battlefront",
      "Category:Third-person shooters",
      "Category:Use mdy dates from May 2021",
      "Category:Video game franchises",
      "Category:Video game franchises introduced in 2004"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: Battlefront (Series)",
      "displaytitle": "<i>Star Wars: Battlefront</i>",
      "wikibase-shortdesc": "Series of first- and third-person Star Wars video games",
      "wikibase_item": "Q54869"
    },
    "requested_title": "Dune Sea",
    "resolved_title": "Star Wars: Battlefront"
  },
  {
    "ok": true,
    "title": "Star Wars: Episode II – Attack of the Clones",
    "pageid": 50957,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Episode_II_%E2%80%93_Attack_of_the_Clones",
    "extract": "Star Wars: Episode II – Attack of the Clones is a 2002 American epic space opera film directed by George Lucas from a screenplay he co-wrote with Jonathan Hales. The sequel to The Phantom Menace (1999), it is the fifth entry in the Star Wars film series and second chronological chapter of the \"Skywalker Saga\". The film stars Ewan McGregor, Natalie Portman, Hayden Christensen, Ian McDiarmid, Samuel L. Jackson, Christopher Lee, Anthony Daniels, Kenny Baker, and Frank Oz.\nThe story is set ten years after The Phantom Menace, as thousands of planetary systems slowly secede from the Galactic Republic and join the newly formed Confederacy of Independent Systems, led by former Jedi Master Count Dooku. With the galaxy on the brink of civil war, Obi-Wan Kenobi investigates a mysterious assassination attempt on Senator Padmé Amidala, which leads him to uncover a clone army in service of the Republic and the truth behind the Separatist movement. Meanwhile, his apprentice Anakin Skywalker is assigned to protect Amidala and develops a secret romance with her. Soon, the trio witness the onset of a new threat to the galaxy: the Clone Wars.\nDevelopment of Attack of the Clones began in March 2000, some months after the release of The Phantom Menace. By June 2000, Lucas and Hales completed a draft of the script, and principal photography took place from June to September 2000. The film crew primarily shot at Fox Studios Australia in Sydney, with additional footage filmed in Tunisia, Italy and Spain. It was one of the first motion pictures shot completely on a high-definition digital 24-frame system.\nAttack of the Clones was released in the United States on May 16, 2002. It received mixed reviews from critics; the film's increased focus on action was praised, while the characters and dialogue were regarded more critically. It performed well at the box office, making $653.8 million worldwide. Yet, it became the first Star Wars film to get outgrossed in its year of release, becoming the fourth-highest-grossing film of 2002 worldwide. Revenge of the Sith (2005) followed Attack of the Clones, concluding the Star Wars prequel trilogy.",
    "categories": [
      "Category:2000s American films",
      "Category:2000s English-language films",
      "Category:2002 films",
      "Category:2002 science fiction action films",
      "Category:20th Century Fox films",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles with unsourced statements",
      "Category:American IMAX films",
      "Category:American epic fantasy films",
      "Category:American prequel films",
      "Category:American science fantasy films",
      "Category:American science fiction action films",
      "Category:American science fiction war films",
      "Category:American sequel films",
      "Category:Articles with hAudio microformats",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from January 2021",
      "Category:Articles with unsourced statements from June 2024",
      "Category:Articles with unsourced statements from May 2023",
      "Category:CS1 maint: multiple names: authors list",
      "Category:English-language science fiction action films",
      "Category:Films about cloning",
      "Category:Films about contract killing",
      "Category:Films about ectogenesis",
      "Category:Films directed by George Lucas",
      "Category:Films produced by Rick McCallum",
      "Category:Films scored by John Williams",
      "Category:Films set in libraries",
      "Category:Films shot at Elstree Film Studios",
      "Category:Films shot in Italy",
      "Category:Films shot in Lake Como",
      "Category:Films shot in Spain",
      "Category:Films shot in Sydney",
      "Category:Films shot in Tunisia",
      "Category:Films using motion capture",
      "Category:Films with screenplays by George Lucas",
      "Category:Films with screenplays by Jonathan Hales",
      "Category:Golden Raspberry Award–winning films",
      "Category:Good articles",
      "Category:IMDb ID (Cite Mojo) different from Wikidata",
      "Category:Interquel films",
      "Category:Lucasfilm films",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Saturn Award–winning films",
      "Category:Short description is different from Wikidata",
      "Category:Spoken articles",
      "Category:Star Wars: Episode II – Attack of the Clones",
      "Category:Star Wars Skywalker Saga films",
      "Category:Teen Choice Award winning films",
      "Category:Template film date with 2 release dates",
      "Category:Use American English from September 2019",
      "Category:Use mdy dates from October 2019",
      "Category:Webarchive template wayback links"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Episode 2: Attack of the Clones",
      "displaytitle": "<i>Star Wars: Episode II – Attack of the Clones</i>",
      "page_image": "Star_Wars_-_Episode_II_Attack_of_the_Clones_(movie_poster).jpg",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "2002 film by George Lucas",
      "wikibase_item": "Q181069"
    },
    "requested_title": "Dungeon Cell",
    "resolved_title": "Star Wars: Episode II – Attack of the Clones"
  },
  {
    "ok": false,
    "requested_title": "Dungeon Corridor",
    "resolved_title": "Greyhawk",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": true,
    "title": "Star Wars: The Clone Wars (film)",
    "pageid": 15726696,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_The_Clone_Wars_(film)",
    "extract": "Star Wars: The Clone Wars is a 2008 American animated epic space opera film directed by Dave Filoni, produced by Lucasfilm Ltd. and Lucasfilm Animation, and distributed by Warner Bros. Pictures, becoming the first Star Wars film to not be distributed by 20th Century Fox. The voice cast consists of Matt Lanter, Ashley Eckstein, James Arnold Taylor, Dee Bradley Baker, Tom Kane, Catherine Taber, Nika Futterman, Ian Abercrombie, Corey Burton, Matthew Wood, Kevin Michael Richardson, David Acord, Samuel L. Jackson, Anthony Daniels, and Christopher Lee. It is the first fully animated film in the Star Wars franchise and takes place shortly after Episode II – Attack of the Clones (2002), at the start of the titular Clone Wars. In the film, Count Dooku and Jabba the Hutt's uncle Ziro orchestrate a plan to turn Jabba against the Galactic Republic by framing the Jedi for the kidnapping of his son. While Anakin Skywalker and his newly assigned apprentice Ahsoka Tano attempt to deliver the child back to his father, Obi-Wan Kenobi and Padmé Amidala lead separate investigations to uncover Dooku and Ziro's plot.\nThe Clone Wars premiered on August 10, 2008, at Grauman's Egyptian Theatre, followed by a wide release five days later. It received generally negative reviews from critics, and grossed $68.3 million worldwide, making it the lowest grossing Star Wars film to date. The film serves as a pilot episode to the television series of the same name, which premiered on Cartoon Network two months after the film's release.\n\n",
    "categories": [
      "Category:2000s English-language films",
      "Category:2008 American animated films",
      "Category:2008 computer-animated films",
      "Category:2008 films",
      "Category:2008 science fiction action films",
      "Category:Album articles lacking alt text for covers",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles with unsourced statements",
      "Category:American animated science fantasy films",
      "Category:American animated science fiction films",
      "Category:American science fiction action films",
      "Category:American science fiction war films",
      "Category:American sequel films",
      "Category:American space adventure films",
      "Category:Animated films about extraterrestrial life",
      "Category:Animated space adventure films",
      "Category:Animated war films",
      "Category:Articles with hAudio microformats",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from August 2023",
      "Category:English-language science fiction action films",
      "Category:Film spinoffs",
      "Category:Films about cloning",
      "Category:Films scored by Kevin Kiner",
      "Category:Films with screenplays by Henry Gilroy",
      "Category:Interquel films",
      "Category:Lucasfilm animated films",
      "Category:Lucasfilm films",
      "Category:Military science fiction films",
      "Category:Official website not in Wikidata",
      "Category:Short description matches Wikidata",
      "Category:Star Wars: The Clone Wars",
      "Category:Star Wars spinoff films",
      "Category:Template film date with 2 release dates",
      "Category:Use American English from November 2024",
      "Category:Use mdy dates from November 2024",
      "Category:Warner Bros. animated films",
      "Category:Warner Bros. films",
      "Category:Webarchive template wayback links"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: The Clone Wars",
      "displaytitle": "<i>Star Wars: The Clone Wars</i> (film)",
      "page_image": "Star_wars_the_clone_wars.jpg",
      "wikibase-shortdesc": "2008 film by Dave Filoni",
      "wikibase_item": "Q382289"
    },
    "requested_title": "East Landing Platform",
    "resolved_title": "Star Wars: The Clone Wars (film)"
  },
  {
    "ok": true,
    "title": "Star Wars Jedi Knight: Mysteries of the Sith",
    "pageid": 30871528,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Jedi_Knight:_Mysteries_of_the_Sith",
    "extract": "Star Wars Jedi Knight: Mysteries of the Sith is an expansion pack for the 1997 first-person shooter Star Wars Jedi Knight: Dark Forces II, developed and published by LucasArts for Microsoft Windows in 1998. It was re-released on Steam in September 2009. The expansion includes a new single-player story mode and fifteen multiplayer maps. The single-player story, set in the Star Wars expanded universe five years after the events of Dark Forces II, follows both returning protagonist Kyle Katarn, a Jedi Master and mercenary working for the New Republic, and Mara Jade, a character featured in numerous Star Wars expanded universe works, who is being trained by Katarn in the Jedi arts. After Katarn goes missing while investigating an ancient Sith temple, Jade continues her studies on her own while undertaking missions from the New Republic, eventually leaving to find Katarn.\nMysteries of the Sith uses the same game engine as Dark Forces II, the Sith engine, but features several technical improvements, including colored lighting, new textures and models, and better AI. The expansion puts more emphasis on lightsaber combat and Force powers, introduced in Dark Forces II. The multiplayer mode allows up to eight players to play online or over a local area network.\nUpon release, the expansion received generally positive reviews. Critics praised its story and AI improvements, but felt there was room for additional improvements and criticized its inconsistent difficulty and certain gameplay elements. It was followed by Star Wars Jedi Knight II: Jedi Outcast in 2002, the next main installment in the Jedi Knight series. A reverse engineered source port called OpenJKDF2 supports Mysteries of the Sith.\n\n",
    "categories": [
      "Category:1998 video games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:CS1 maint: bot: original URL status unknown",
      "Category:First-person shooters",
      "Category:Good articles",
      "Category:LucasArts games",
      "Category:Multiplayer and single-player video games",
      "Category:Sequel video games",
      "Category:Short description is different from Wikidata",
      "Category:Sith (game engine) games",
      "Category:Star Wars: Jedi Knight",
      "Category:Use mdy dates from August 2013",
      "Category:Video game expansion packs",
      "Category:Video games developed in the United States",
      "Category:Video games featuring female protagonists",
      "Category:Video games scored by Peter McConnell",
      "Category:Windows-only games",
      "Category:Windows games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars Jedi Knight: Mysteries of the Sith</i>",
      "page_image": "Mystery-of-the-Sith.jpg",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "1998 video game",
      "wikibase_item": "Q55301"
    },
    "requested_title": "Emperor's Throne Room",
    "resolved_title": "Star Wars Jedi Knight: Mysteries of the Sith"
  },
  {
    "ok": true,
    "title": "Galactic Empire (Star Wars)",
    "pageid": 68430,
    "fullurl": "https://en.wikipedia.org/wiki/Galactic_Empire_(Star_Wars)",
    "extract": "The Galactic Empire, also known simply as the Empire, is a fictional autocracy featured in the Star Wars franchise. Introduced in the 1977 film Star Wars, it is the main antagonistic faction of the original trilogy, which also includes The Empire Strikes Back (1980) and Return of the Jedi (1983). An oppressive dictatorship with a complicated bureaucracy, the Galactic Empire seeks the rule and social control of every planet and civilization within the galaxy, based on anthropocentrism, nationalisation, state terrorism, power projection, and threat of lethal force.\nThe Galactic Empire's rise was not a violent takeover by force, but rather a consolidating unprecedented and unchecked power in the Chancellor via a calculated Gleichschaltung-like dismantling of the galaxy's most powerful institutions by undermining the public's faith in these institutions, rewriting constitutional foundations, controlling the Jedi Council, weakening the Galactic Senate, court packing the Supreme Court and the appointment of loyal Governors. At its peak, the Galactic Empire sprawls over much of the known Star Wars galaxy, which consists of millions of habitable star systems and billions more fringe colonies, shipyards, fortress worlds, and outer territories. The Empire's origins are depicted in the prequel film Revenge of the Sith (2005), where it replaces the Galactic Republic at the end of the Clone Wars orchestrated by the Republic's Supreme Chancellor, Palpatine. Palpatine is also secretly the Sith Lord Darth Sidious, who masterminds the war to destroy the Jedi and restore the Sith to power.\nPalpatine falsely accuses the Jedi of causing the secessionist Clone Wars to weaken the Republic and gain political power. He manipulates the Galactic Senate into using clone troopers created during the conflict to purge the Jedi. After engineering these threats, Palpatine reorganizes the Republic into a state meant to \"ensure the security and continuing stability, and a safe and secure society\": the Galactic Empire, with himself as Emperor ad infinitum. The Senate overwhelmingly supports this decision and lauds his apparent resolve, bravery, and selflessness.\nWith Emperor Palpatine keeping mostly to the shadows, his Sith apprentice, commander-in-chief Darth Vader maintains a more public presence and leads the Imperial forces, acting as a national personification of the Galactic Empire's power. By the time of Episode IV – A New Hope, the faction has transformed into a fully autocratic regime, though it is opposed by the insurgent Alliance to Restore the Republic. The completion of the Death Star, a planet-destroying battle station, allows Emperor Palpatine to instigate a self-coup, dissolving the Imperial Senate and transferring power to Praetor-officers called Imperial Moffs, such as Grand Moff Tarkin.\nThe Galactic Empire collapses after the events of Return of the Jedi. Its remnants form the First Order in the sequel trilogy, set 30 years later.\n\n",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles containing German-language text",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from February 2020",
      "Category:Autocracy",
      "Category:CS1 errors: ISBN",
      "Category:Commons category link is on Wikidata",
      "Category:Fictional elements introduced in 1977",
      "Category:Fictional totalitarian states",
      "Category:Film supervillains",
      "Category:Galactic empires",
      "Category:Short description is different from Wikidata",
      "Category:Sith",
      "Category:Star Wars governments",
      "Category:Villains in animated television series",
      "Category:Webarchive template wayback links",
      "Category:Wikipedia articles needing page number citations from January 2019"
    ],
    "pageprops": {
      "displaytitle": "Galactic Empire (<i>Star Wars</i>)",
      "page_image_free": "Emblem_of_the_First_Galactic_Empire.svg",
      "toc": "",
      "wikibase-shortdesc": "Fictional state in the Star Wars franchise",
      "wikibase_item": "Q52347"
    },
    "requested_title": "Emperor's Tower",
    "resolved_title": "Galactic Empire (Star Wars)"
  },
  {
    "ok": true,
    "title": "Endor (Star Wars)",
    "pageid": 905464,
    "fullurl": "https://en.wikipedia.org/wiki/Endor_(Star_Wars)",
    "extract": "Endor (designated: IX3244-A) is a fictional moon in the Star Wars universe, known for its endless forests, savannahs, grasslands, mountain ranges, and a few oceans. The moon was the site of a pivotal battle depicted in Return of the Jedi. It is the homeworld of the sentient Dulok, Ewok, and Yuzzum species, as well as the semi-sentient Gorax and Wistie species. The Endor solar cycle is 402 GSC days orbital, with a breathable earth-like atmosphere conducive for humans, 85% Standard Gravity  and 8% surface water. It is where Darth Vader's funeral is held.\nThe moon orbits Tana—the Ewokese word for Endor's host planet—a gas giant located in the Endor system, a star system positioned in the Moddell sector of the galaxy's Outer Rim Territories. Located in grid square H-16 on the Standard Galactic Grid, it was connected to Cerea and Bakura by a hyperspace route. Other nearby planets in the H-16 sector include Rattatak, Bunduki, Tirracles, Ponemah, and Firrerre. The planet was orbited by nine moons, the largest of which was known as the forest moon of Endor or \"sanctuary moon\". The ocean moon of Kef Bir was also one of these moons, and is the location where the second Death Star crashed after it exploded over Endor in Return of the Jedi. It also had two suns: Endor Prime I and Endor Prime II.\n\n",
    "categories": [
      "Category:All articles with topics of unclear notability",
      "Category:Articles with short description",
      "Category:Articles with topics of unclear notability from November 2023",
      "Category:Ewoks",
      "Category:Fiction articles with topics of unclear notability",
      "Category:Fictional elements introduced in 1983",
      "Category:Fictional planets",
      "Category:Return of the Jedi",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars planets",
      "Category:Use mdy dates from May 2020"
    ],
    "pageprops": {
      "displaytitle": "Endor (<i>Star Wars</i>)",
      "page_image": "PlanetEndor.jpg",
      "wikibase-shortdesc": "Fictional moon in Star Wars",
      "wikibase_item": "Q12180673"
    },
    "requested_title": "Endor",
    "resolved_title": "Endor (Star Wars)"
  },
  {
    "ok": true,
    "title": "List of Star Wars Rebels characters",
    "pageid": 50554103,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_Rebels_characters",
    "extract": "Star Wars Rebels (2014–2018) is an American 3D CGI animated television series produced by Lucasfilm Animation. The series follows a motley group of rebels conducting covert operations to thwart the sinister Galactic Empire, including Kanan Jarrus, Hera Syndulla, Ezra Bridger, Zeb Orrellios, Chopper, and Sabine Wren. The 2023 live-action series Ahsoka serves as a direct continuation of Rebels, following on from the events of its series finale.",
    "categories": [
      "Category:All Wikipedia articles written in American English",
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:Lists of characters in American television animation",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars Rebels characters",
      "Category:Star Wars character lists",
      "Category:Teenage characters in television",
      "Category:Use American English from July 2022",
      "Category:Use mdy dates from August 2022"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Rebels characters",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q24905537"
    },
    "requested_title": "Endor Forest",
    "resolved_title": "List of Star Wars Rebels characters"
  },
  {
    "ok": true,
    "title": "List of Star Wars video games",
    "pageid": 1425342,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_video_games",
    "extract": "This is a list of Star Wars video games. This page only includes games developed or published by LucasArts, or officially licensed by Lucasfilm.",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from January 2023",
      "Category:CS1: unfit URL",
      "Category:CS1 German-language sources (de)",
      "Category:Lists of stories",
      "Category:Lists of video games by franchise",
      "Category:LucasArts games",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars lists",
      "Category:Star Wars video games"
    ],
    "pageprops": {
      "defaultsort": "List Of Star Wars Video Games",
      "displaytitle": "List of <i>Star Wars</i> video games",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q54336"
    },
    "requested_title": "Ewok Village",
    "resolved_title": "List of Star Wars video games"
  },
  {
    "ok": false,
    "requested_title": "Ewok Village Square",
    "resolved_title": "List of licensed and localized editions of Monopoly: USA",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": false,
    "requested_title": "Ext/Int",
    "resolved_title": "Visual Effects Society Award for Outstanding Model in a Photoreal or Animated Project",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": true,
    "title": "Universe of Star Wars",
    "pageid": 79982081,
    "fullurl": "https://en.wikipedia.org/wiki/Universe_of_Star_Wars",
    "extract": "The Star Wars multimedia and film franchise is set in a fictional universe, most events of which occur in a single galaxy in that universe. Originally established by George Lucas as a \"galaxy far, far away\", it comprises numerous planets, moons, star systems, and species. The galaxy is divided into four broad sub-regions: the Core Worlds, Mid Rim, Outer Rim, and Unknown Regions. Notable planets include Coruscant, an ecumenopolis in the Core that functions as a political and cultural center, and Tatooine, a desert planet located in the Outer Rim. The universe initially encompassed a collection of works recognized as canon by Lucasfilm as part of the official Star Wars storyline. Subsequent expanded material in other media was later rebranded as the Legends universe by Disney, declaring it non-canonical to the official universe.\nWithin this fictional body exists a variety of intelligent species, including Humans, Twi’leks, Wookiees, Rodians, and Hutts, as well as several major governing bodies throughout galactic history, such as the Galactic Republic, Galactic Empire, Rebel Alliance, New Republic, and First Order. Each of these entities operates under differing political structures, ranging from democratic institutions to totalitarian regimes. Interstellar travel is facilitated by hyperspace, allowing rapid movement between distant star systems. A central metaphysical concept in the Star Wars universe is the Force, an omnipresent energy field that connects all living things. The Force is divided into two principal aspects: the Light Side, traditionally followed by the Jedi Order, and the Dark Side, embraced by the Sith. The universe also features a high level of technological advancement, including starships, droids, and energy-based weapons such as blasters and lightsabers. The timeline of in-universe events is often measured in reference to the Battle of Yavin, a pivotal conflict depicted in the original 1977 film, serving as a chronological anchor for subsequent developments in the franchise.",
    "categories": [
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:CS1 maint: bot: original URL status unknown",
      "Category:Fictional universes",
      "Category:Harv and Sfn no-target errors",
      "Category:Lucasfilm",
      "Category:Mass media franchises introduced in 1977",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Science fiction franchises",
      "Category:Short description is different from Wikidata",
      "Category:Space opera",
      "Category:Star Wars"
    ],
    "pageprops": {
      "displaytitle": "Universe of <i>Star Wars</i>",
      "page_image_free": "Star_Wars_in_Tunisia_-_Lars_Homestead_in_Chott_el_Djerid_(cropped).jpg",
      "wikibase-shortdesc": "Fictional universe of a media franchise",
      "wikibase_item": "Q19786052"
    },
    "requested_title": "Forest",
    "resolved_title": "Universe of Star Wars"
  },
  {
    "ok": false,
    "requested_title": "Forest Clearing",
    "resolved_title": "Leonardo DiCaprio",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": true,
    "title": "Music of Star Wars",
    "pageid": 3006526,
    "fullurl": "https://en.wikipedia.org/wiki/Music_of_Star_Wars",
    "extract": "The music of the Star Wars franchise is composed and produced in conjunction with the development of the feature films, television series, and other merchandise within the epic space opera multimedia franchise created by George Lucas. The music for the primary feature films (which serves as the basis for the rest of the related media) was written by John Williams. Williams' work on the series included the scores of nine feature films, a suite and several cues of thematic material for Solo: A Star Wars Story and the theme music for the Star Wars: Galaxy's Edge theme parks at Disneyland and Walt Disney World. These count among the most widely known and popular contributions to modern film music, and utilize a symphony orchestra and features an assortment of about fifty recurring musical themes to represent characters and other plot elements: one of the largest caches of themes in the history of film music.\nReleased between 1977 and 2019, the music for the primary feature films was, in the case of the first two trilogies, performed by the London Symphony Orchestra and, in select passages, by the London Voices chorus. The sequel trilogy was largely conducted by Williams and William Ross, and performed by the Hollywood Freelance Studio Symphony and (in a few passages) by the Los Angeles Master Chorale.\nAdditional composers have since contributed music to other movies and media within the Star Wars universe. The music for several animated and live-action television series spin-offs has been written by Kevin Kiner, Ludwig Göransson, Natalie Holt, Nicholas Britell, and Ryan Shore. Music for the spin-off films, other television programs, and video games, as well as the trailers of the various installments, were created by various other composers, with this material occasionally revisiting some of Williams' principal themes (and, with one spin-off film, with Williams actually writing a new theme for the composer to use).\nThe scores are primarily performed by a symphony orchestra of varying size joined, in several sections, by a choir of varying size. They each make extensive use of the leitmotif, or a series of musical themes that represents the various characters, objects and events in the films. Throughout all of the franchise, which consists of a total of over 18 hours of music, Williams has written approximately sixty or seventy themes, in one of the largest, richest collection of themes in the history of film music.",
    "categories": [
      "Category:All Wikipedia articles written in American English",
      "Category:All articles covered by WikiProject Wikify",
      "Category:All articles needing references cleanup",
      "Category:All articles with unsourced statements",
      "Category:Articles covered by WikiProject Wikify from October 2023",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from December 2020",
      "Category:CS1 maint: archived copy as title",
      "Category:Film music compositions by John Williams",
      "Category:Music by media franchise",
      "Category:Music of Star Wars",
      "Category:Pages using the Phonos extension",
      "Category:Short description with empty Wikidata description",
      "Category:Use American English from October 2022",
      "Category:Use mdy dates from October 2017",
      "Category:Webarchive template wayback links",
      "Category:Wikipedia references cleanup from October 2023"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Music",
      "displaytitle": "Music of <i>Star Wars</i>",
      "page_image_free": "John_Williams_tux.jpg",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q2061394"
    },
    "requested_title": "Forest Landing Site",
    "resolved_title": "Music of Star Wars"
  },
  {
    "ok": true,
    "title": "Star Wars: Galaxy of Heroes",
    "pageid": 48581597,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Galaxy_of_Heroes",
    "extract": "Star Wars: Galaxy of Heroes is a mobile collectible RPG game. The game received a soft launch in Australia during October 2015, and was formally released on November 24, 2015.\nA Microsoft Windows port of the game was announced to be in development in the spring of 2024.\nAs of late 2021, the game had surpassed 100 million downloads and had generated over $1.4 billion in revenue.",
    "categories": [
      "Category:2015 video games",
      "Category:All articles with dead external links",
      "Category:Android (operating system) games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with dead external links from February 2022",
      "Category:Articles with dead external links from November 2025",
      "Category:Articles with short description",
      "Category:EA Mobile games",
      "Category:Electronic Arts games",
      "Category:IOS games",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Role-playing video games",
      "Category:Short description is different from Wikidata",
      "Category:Use mdy dates from May 2016",
      "Category:Video games developed in the United States",
      "Category:Webarchive template wayback links"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: Galaxy of Heroes</i>",
      "page_image": "Star_Wars_-_Galaxy_of_Heroes.jpg",
      "wikibase-shortdesc": "2015 video game",
      "wikibase_item": "Q21775900"
    },
    "requested_title": "Galaxy",
    "resolved_title": "Star Wars: Galaxy of Heroes"
  },
  {
    "ok": false,
    "requested_title": "Gantry",
    "resolved_title": "Arrol Gantry",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": true,
    "title": "List of Star Wars: The Clone Wars episodes",
    "pageid": 19229713,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars:_The_Clone_Wars_episodes",
    "extract": "Star Wars: The Clone Wars is an American 3D CGI animated television series created by Lucasfilm Animation, Lucasfilm Animation Singapore, and CGCG Inc. The debut film was released in theaters on August 15, 2008; it served as the introduction of the series. The series made its debut on the American Cartoon Network on October 3, 2008. It is set in the fictional Star Wars galaxy during the three-year interim between Episode II – Attack of the Clones and Episode III – Revenge of the Sith (the same time period as the previous 2003 Clone Wars series). Each episode has a running time of 22 minutes, filling a half-hour time slot. \nIn March 2013, following the 2012 acquisition of Lucasfilm by Disney, the series was cancelled. The unreleased episodes that had already been produced were referred to at the time as \"bonus content\". The German television network Super RTL began to air these episodes as a sixth season, which consisted of 13 episodes in February 2014. Season 6, along with the other seasons and the feature film, were made available on Netflix on March 7 the same year. The series returned with 12 new episodes on Disney+, serving as the seventh and final season. It premiered February 21, 2020. During the course of the series, 133 episodes of Star Wars: The Clone Wars were released over seven seasons, between October 3, 2008, and May 4, 2020.",
    "categories": [
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:CS1 German-language sources (de)",
      "Category:Episode lists with TBA values",
      "Category:Lists of American children's animated television series episodes",
      "Category:Lists of American science fiction television series episodes",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars: The Clone Wars episodes",
      "Category:Star Wars episode lists",
      "Category:Use mdy dates from March 2020"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: The Clone Wars episodes, List of",
      "displaytitle": "List of <i>Star Wars: The Clone Wars</i> episodes",
      "page_image_free": "Star_Wars_The_Clone_Wars.svg",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q918379"
    },
    "requested_title": "Gold Five's Cockpit",
    "resolved_title": "List of Star Wars: The Clone Wars episodes"
  },
  {
    "ok": true,
    "title": "Star Wars (film)",
    "pageid": 52549,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_(film)",
    "extract": "Star Wars (also known as Star Wars: Episode IV – A New Hope) is a 1977 American epic space opera film written and directed by George Lucas, produced by Lucasfilm Ltd. and released by Twentieth Century-Fox. It is the first film in the Star Wars franchise and the fourth chronological chapter of the \"Skywalker Saga\". Set in a fictional galaxy under the rule of the tyrannical Galactic Empire, the film follows a resistance movement, called the Rebel Alliance, that aims to destroy the Empire's ultimate weapon, the Death Star. When the rebel leader Princess Leia is captured by the Galactic Empire, Luke Skywalker acquires stolen architectural plans for the Death Star and sets out to rescue her while learning the ways of a metaphysical power known as \"the Force\" from the Jedi Master Obi-Wan Kenobi. The cast includes Mark Hamill, Harrison Ford, Carrie Fisher, Peter Cushing, Alec Guinness, Anthony Daniels, Kenny Baker, Peter Mayhew, David Prowse, and James Earl Jones.\nLucas had the idea for a science fiction film in the vein of Flash Gordon around the time he completed his first film, THX 1138 (1971), and he began working on a treatment after the release of American Graffiti (1973). After numerous rewrites, principal photography began in March of 1976 in locations including Tunisia and Elstree Studios in Hertfordshire, England. Lucas formed the visual effects company Industrial Light & Magic to help create the film's visual effects. Star Wars suffered production difficulties: the cast and crew believed the film would be a failure, and it went $3 million over budget due to delays.\nFew were confident in the film's box office prospects. It was released in a small number of theaters in the United States on May 25, 1977, and quickly became a surprise blockbuster hit, leading to it being expanded to a much wider release. Star Wars opened to universal acclaim, with praise for its special effects. It grossed $410 million worldwide during its initial run, surpassing Jaws (1975) to become the highest-grossing film until the release of E.T. the Extra-Terrestrial (1982); subsequent releases have brought its total gross to $775 million. When adjusted for inflation, Star Wars is the second-highest-grossing film in North America (behind Gone with the Wind) and the fourth-highest-grossing film of all time. It received six Academy Awards, two BAFTA Awards, and thirteen Saturn Awards, among others. The film has been reissued many times with Lucas's support, including the 1981 reissue giving the film the subtitle Episode IV – A New Hope, and the 1997 \"Special Edition\". The reissues have contained many changes, including new scenes, visual effects, and dialogue.\nOften regarded as one of the greatest and most influential films of all time, Star Wars quickly became a worldwide pop culture phenomenon, launching an industry of tie-in products, including novels, comics, video games, amusement park attractions and merchandise such as toys, games, and clothing. It became one of the first 25 films selected by the United States Library of Congress for preservation in the National Film Registry in 1989, and its soundtrack was added to the U.S. National Recording Registry in 2004. The Empire Strikes Back (1980) and Return of the Jedi (1983) followed Star Wars, rounding out the original Star Wars trilogy. A prequel trilogy and a sequel trilogy have since been released, in addition to two standalone films and various television series.",
    "categories": [
      "Category:1970s American films",
      "Category:1970s English-language films",
      "Category:1970s science fiction action films",
      "Category:1970s science fiction war films",
      "Category:1977 films",
      "Category:1977 science fiction films",
      "Category:20th Century Fox films",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles lacking reliable references",
      "Category:All articles with dead external links",
      "Category:All pages needing factual verification",
      "Category:American epic fantasy films",
      "Category:American epic films",
      "Category:American robot films",
      "Category:American science fantasy films",
      "Category:American science fiction action films",
      "Category:American science fiction films",
      "Category:American science fiction war films",
      "Category:American space adventure films",
      "Category:American space opera films",
      "Category:Articles lacking reliable references from March 2024",
      "Category:Articles with dead external links from September 2023",
      "Category:Articles with permanently dead external links",
      "Category:Articles with short description",
      "Category:BAFTA winners (films)",
      "Category:CS1: unfit URL",
      "Category:CS1 Russian-language sources (ru)",
      "Category:CS1 uses Russian-language script (ru)",
      "Category:Commons category link is on Wikidata",
      "Category:English-language science fiction action films",
      "Category:English-language war films",
      "Category:Films about mercenaries",
      "Category:Films about rebellions",
      "Category:Films about violence",
      "Category:Films directed by George Lucas",
      "Category:Films produced by Gary Kurtz",
      "Category:Films scored by John Williams",
      "Category:Films shot in Guatemala",
      "Category:Films shot in Tunisia",
      "Category:Films that won the Best Costume Design Academy Award",
      "Category:Films that won the Best Original Score Academy Award",
      "Category:Films that won the Best Sound Editing Academy Award",
      "Category:Films that won the Best Sound Mixing Academy Award",
      "Category:Films that won the Best Visual Effects Academy Award",
      "Category:Films whose editor won the Best Film Editing Academy Award",
      "Category:Films whose production designer won the Best Production Design Academy Award",
      "Category:Films with screenplays by George Lucas",
      "Category:IMDb ID (Cite Mojo) different from Wikidata",
      "Category:Lucasfilm films",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Saturn Award–winning films",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars (film)",
      "Category:Star Wars Skywalker Saga films",
      "Category:Template film date with 1 release date",
      "Category:The Numbers ID different from Wikidata",
      "Category:United States National Film Registry films",
      "Category:Use American English from September 2019",
      "Category:Use mdy dates from March 2024",
      "Category:Wikipedia articles needing factual verification from October 2025",
      "Category:Wikipedia indefinitely move-protected pages"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Episode 4: A New Hope",
      "displaytitle": "<i>Star Wars</i> (film)",
      "page_image": "StarWarsMoviePoster1977.jpg",
      "wikibase-shortdesc": "1977 film by George Lucas",
      "wikibase_item": "Q17738"
    },
    "requested_title": "Gold Five's Y-Wing",
    "resolved_title": "Star Wars (film)"
  },
  {
    "ok": true,
    "title": "List of Star Wars: The Clone Wars episodes",
    "pageid": 19229713,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars:_The_Clone_Wars_episodes",
    "extract": "Star Wars: The Clone Wars is an American 3D CGI animated television series created by Lucasfilm Animation, Lucasfilm Animation Singapore, and CGCG Inc. The debut film was released in theaters on August 15, 2008; it served as the introduction of the series. The series made its debut on the American Cartoon Network on October 3, 2008. It is set in the fictional Star Wars galaxy during the three-year interim between Episode II – Attack of the Clones and Episode III – Revenge of the Sith (the same time period as the previous 2003 Clone Wars series). Each episode has a running time of 22 minutes, filling a half-hour time slot. \nIn March 2013, following the 2012 acquisition of Lucasfilm by Disney, the series was cancelled. The unreleased episodes that had already been produced were referred to at the time as \"bonus content\". The German television network Super RTL began to air these episodes as a sixth season, which consisted of 13 episodes in February 2014. Season 6, along with the other seasons and the feature film, were made available on Netflix on March 7 the same year. The series returned with 12 new episodes on Disney+, serving as the seventh and final season. It premiered February 21, 2020. During the course of the series, 133 episodes of Star Wars: The Clone Wars were released over seven seasons, between October 3, 2008, and May 4, 2020.",
    "categories": [
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:CS1 German-language sources (de)",
      "Category:Episode lists with TBA values",
      "Category:Lists of American children's animated television series episodes",
      "Category:Lists of American science fiction television series episodes",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars: The Clone Wars episodes",
      "Category:Star Wars episode lists",
      "Category:Use mdy dates from March 2020"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: The Clone Wars episodes, List of",
      "displaytitle": "List of <i>Star Wars: The Clone Wars</i> episodes",
      "page_image_free": "Star_Wars_The_Clone_Wars.svg",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q918379"
    },
    "requested_title": "Gold Leader's Cockpit",
    "resolved_title": "List of Star Wars: The Clone Wars episodes"
  },
  {
    "ok": true,
    "title": "Star Wars: Squadrons",
    "pageid": 64262611,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Squadrons",
    "extract": "Star Wars: Squadrons is a space combat game set in the Star Wars universe, developed by Motive Studio and published by Electronic Arts. It was released for PlayStation 4, Windows, and Xbox One, on October 2, 2020, and for Xbox Series X/S on December 3, 2020. The game features both multiplayer game modes and a single-player campaign. Set after Return of the Jedi, the campaign alternates between the New Republic's Vanguard Squadron and the Galactic Empire's Titan Squadron, both of which become involved with the Republic's Project Starhawk; Vanguard Squadron wants to ensure its completion, while Titan Squadron attempts to destroy it.\nThe game received generally favorable reviews upon release, garnering praise for its gameplay, while facing some criticism over its story and lack of content. The game sold more than 1.1 million digital copies as of October 2020.\n\n",
    "categories": [
      "Category:2020 video games",
      "Category:Action games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Electronic Arts games",
      "Category:Frostbite (game engine) games",
      "Category:Motive Studio games",
      "Category:Multiplayer and single-player video games",
      "Category:PlayStation 4 games",
      "Category:Short description is different from Wikidata",
      "Category:Space combat simulators",
      "Category:Space opera video games",
      "Category:Star Wars video games",
      "Category:Use mdy dates from December 2020",
      "Category:Video games developed in Canada",
      "Category:Video games set in outer space",
      "Category:Virtual reality games",
      "Category:Windows games",
      "Category:Xbox One games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: Squadrons</i>",
      "page_image": "Star_Wars_Squadrons.jpg",
      "wikibase-shortdesc": "2020 video game",
      "wikibase_item": "Q96312725"
    },
    "requested_title": "Gold Leader's Y-Wing",
    "resolved_title": "Star Wars: Squadrons"
  },
  {
    "ok": true,
    "title": "Star Wars: Visions",
    "pageid": 67236489,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Visions",
    "extract": "Star Wars: Visions is an animated anthology television series created for the American streaming service Disney+. Produced by Lucasfilm, the series consists of original animated short films set in, or inspired by, the Star Wars universe, with each episode being a self-contained narrative produced by various studios.\nThe first volume of nine anime short films were produced by seven Japanese animation studios: Kamikaze Douga, Studio Colorido, Geno Studio, Trigger, Kinema Citrus, Production I.G, and Science Saru, with Trigger and Science Saru producing two shorts each. The second volume expanded the series to animation studios around the world, featuring shorts from El Guiri (Spain), Cartoon Saloon (Ireland), Punkrobot (Chile), Aardman (United Kingdom), Studio Mir (South Korea), Studio La Cachette (France), 88 Pictures (India), D'art Shtajio (Japan) along with Lucasfilm (United States), and Triggerfish (South Africa/Ireland). The creators at each studio are given free rein to re-envision the ideas of Star Wars as they see fit, while receiving guidance from Lucasfilm's executive team.\nThe first volume was released on September 22, 2021, while the second was released on May 4, 2023. Both volumes have received critical acclaim. A third volume was released on October 29, 2025.\n\n",
    "categories": [
      "Category:2020s American animated television series",
      "Category:2020s American anthology television series",
      "Category:2020s American science fiction television series",
      "Category:2021 American animated television series debuts",
      "Category:2021 anime ONAs",
      "Category:All Wikipedia articles written in American English",
      "Category:American animated science fiction television series",
      "Category:American animation anthology series",
      "Category:American anime-influenced animated television series",
      "Category:Anime short films",
      "Category:Articles containing Japanese-language text",
      "Category:Articles containing Korean-language text",
      "Category:Articles with short description",
      "Category:CS1 Japanese-language sources (ja)",
      "Category:CS1 Spanish-language sources (es)",
      "Category:CS1 uses Japanese-language script (ja)",
      "Category:Cartoon Saloon short films",
      "Category:David Production",
      "Category:Disney+ original anime",
      "Category:Kinema Citrus",
      "Category:Polygon Pictures",
      "Category:Production I.G",
      "Category:Science Saru",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars animated television series",
      "Category:Studio Colorido",
      "Category:Studio Mir",
      "Category:Studio Trigger",
      "Category:Television series about talking animals",
      "Category:Television series by Lucasfilm",
      "Category:Use American English from July 2021",
      "Category:Use mdy dates from May 2022",
      "Category:Wit Studio"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: Visions</i>",
      "page_image": "Star_Wars_Visions_Logo.jpg",
      "wikibase-shortdesc": "Animated anthology series",
      "wikibase_item": "Q104161600"
    },
    "requested_title": "Gold Two's Y-Wing",
    "resolved_title": "Star Wars: Visions"
  },
  {
    "ok": true,
    "title": "List of Star Wars spacecraft",
    "pageid": 4042821,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_spacecraft",
    "extract": "The following is a list of starships, cruisers, battleships, and other spacecraft in the Star Wars films, books, and video games.\nWithin the fictional universe of the Star Wars setting, there are a wide variety of different spacecraft defined by their role and type. Among the many civilian spacecraft are cargo freighters, passenger transports, diplomatic couriers, personal shuttles and escape pods. Warships likewise come in many shapes and sizes, from small patrol ships and troop transports to large capital ships like Star Destroyers and other battleships. Starfighters also feature prominently in the setting.\nMany fictional technologies are incorporated into Star Wars starships, fantastical devices developed over the millennia of the setting's history. Hyperdrives provides for faster-than-light travel between stars at instantaneous speeds, though traveling uncharted routes can be dangerous. Sublight engines allow spacecraft to get clear of a planet's gravitational well in minutes and travel interplanetary distances easily. For travel within planetary atmospheres or for taking off and landing, anti-gravity devices known as repulsorlifts are used. Other gravity-manipulation technologies include tractor beams to grab onto objects and acceleration compensators to protect passengers from high g-forces. Protective barriers called deflector shields defend against threats, while many ships carry different types of weaponry.\n\n",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from October 2020",
      "Category:Articles with unsourced statements from September 2025",
      "Category:Commons category link is locally defined",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars lists",
      "Category:Star Wars spacecraft"
    ],
    "pageprops": {
      "defaultsort": "Spacecraft",
      "displaytitle": "List of <i>Star Wars</i> spacecraft",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q3255153"
    },
    "requested_title": "Headquarters Frigate",
    "resolved_title": "List of Star Wars spacecraft"
  },
  {
    "ok": true,
    "title": "Hoth",
    "pageid": 261660,
    "fullurl": "https://en.wikipedia.org/wiki/Hoth",
    "extract": "Hoth is an ice planet in the Star Wars fictional universe. It first appeared in the 1980 film The Empire Strikes Back and has also been a setting in Star Wars books and video games.",
    "categories": [
      "Category:Articles with short description",
      "Category:Fictional elements introduced in 1980",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars planets"
    ],
    "pageprops": {
      "page_image": "Hothplanetsurface.jpg",
      "wikibase-shortdesc": "Fictional planet in Star Wars",
      "wikibase_item": "Q739771"
    },
    "requested_title": "Hoth",
    "resolved_title": "Hoth"
  },
  {
    "ok": true,
    "title": "Star Wars Jedi: Survivor",
    "pageid": 70886321,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Jedi:_Survivor",
    "extract": "Star Wars Jedi: Survivor is a 2023 action-adventure game developed by Respawn Entertainment and published by Electronic Arts. The game is the sequel to Star Wars Jedi: Fallen Order (2019), taking place five years after the events of the previous game and continuing the adventure of young Jedi Knight Cal Kestis (Cameron Monaghan), as he and his friends continue in their struggle to survive the tyranny of the Galactic Empire while racing against a corrupted High Republic Jedi to reach a shrouded planet that can serve as a safe haven for those oppressed by the Empire. As with its predecessor, Survivor's structure was inspired by Metroidvania games, with gameplay split between combating hostile enemies using Cal's lightsaber and Force powers, platforming, and puzzle-solving.\nDevelopment of the game began in late 2019 and lasted for three and a half years, with Stig Asmussen once again serving as the game's director. It was the last game released by EA during its 10-year exclusivity contract with Lucasfilm to produce Star Wars games. With the sequel, the goal for the team was to significantly expand its scope and scale, refining mechanics established in Fallen Order while introducing new gameplay features such as AI-controlled companions. The team collaborated closely with Lucasfilm while writing the game's narrative, which had a significantly darker tone when compared with Fallen Order. In Survivor, Cal grapples with the futility of the rebellion and the dominance of the Empire while facing several antagonists that serve as foils.\nAnnounced in May 2022, Star Wars Jedi: Survivor was released for PlayStation 5, Windows, and Xbox Series X/S on April 28, 2023. Versions for PlayStation 4 and Xbox One were released on September 17, 2024. The game was met with positive reviews from critics, who praised the characters, combat, level design, and music, with most deeming it a significant improvement over its predecessor. The PC version of the game, however, was criticized for its technical issues. It was a commercial success for the publisher, and it was nominated for multiple year-end awards, including Best Action/Adventure Game at The Game Awards 2023 and Adventure Game of the Year at the 27th Annual D.I.C.E. Awards. A sequel, which also serves as a conclusion to Cal's story, is in development.",
    "categories": [
      "Category:2023 video games",
      "Category:Action-adventure games",
      "Category:All Wikipedia articles written in American English",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Commons category link from Wikidata",
      "Category:Electronic Arts games",
      "Category:Good articles",
      "Category:Pages using multiple image with auto scaled images",
      "Category:PlayStation 4 Pro enhanced games",
      "Category:PlayStation 4 games",
      "Category:PlayStation 5 Pro enhanced games",
      "Category:PlayStation 5 games",
      "Category:Respawn Entertainment games",
      "Category:Short description is different from Wikidata",
      "Category:Single-player video games",
      "Category:Soulslike video games",
      "Category:Space opera video games",
      "Category:Star Wars: The High Republic",
      "Category:Star Wars Jedi (series)",
      "Category:Star Wars video games",
      "Category:Unreal Engine 4 games",
      "Category:Use American English from December 2022",
      "Category:Use mdy dates from April 2023",
      "Category:Video games developed in the United States",
      "Category:Windows games",
      "Category:Xbox One X enhanced games",
      "Category:Xbox One games",
      "Category:Xbox Series X and Series S games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars Jedi: Survivor</i>",
      "page_image": "Star_Wars_Jedi_Survivor.jpg",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "2023 video game",
      "wikibase_item": "Q112704136"
    },
    "requested_title": "Imperial Landing Platform",
    "resolved_title": "Star Wars Jedi: Survivor"
  },
  {
    "ok": true,
    "title": "List of Star Wars spacecraft",
    "pageid": 4042821,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_spacecraft",
    "extract": "The following is a list of starships, cruisers, battleships, and other spacecraft in the Star Wars films, books, and video games.\nWithin the fictional universe of the Star Wars setting, there are a wide variety of different spacecraft defined by their role and type. Among the many civilian spacecraft are cargo freighters, passenger transports, diplomatic couriers, personal shuttles and escape pods. Warships likewise come in many shapes and sizes, from small patrol ships and troop transports to large capital ships like Star Destroyers and other battleships. Starfighters also feature prominently in the setting.\nMany fictional technologies are incorporated into Star Wars starships, fantastical devices developed over the millennia of the setting's history. Hyperdrives provides for faster-than-light travel between stars at instantaneous speeds, though traveling uncharted routes can be dangerous. Sublight engines allow spacecraft to get clear of a planet's gravitational well in minutes and travel interplanetary distances easily. For travel within planetary atmospheres or for taking off and landing, anti-gravity devices known as repulsorlifts are used. Other gravity-manipulation technologies include tractor beams to grab onto objects and acceleration compensators to protect passengers from high g-forces. Protective barriers called deflector shields defend against threats, while many ships carry different types of weaponry.\n\n",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from October 2020",
      "Category:Articles with unsourced statements from September 2025",
      "Category:Commons category link is locally defined",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars lists",
      "Category:Star Wars spacecraft"
    ],
    "pageprops": {
      "defaultsort": "Spacecraft",
      "displaytitle": "List of <i>Star Wars</i> spacecraft",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q3255153"
    },
    "requested_title": "Imperial Shuttle",
    "resolved_title": "List of Star Wars spacecraft"
  },
  {
    "ok": true,
    "title": "Star Wars",
    "pageid": 26678,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars",
    "extract": "Star Wars is an American epic space opera media franchise created by George Lucas, which began with the eponymous 1977 film and quickly became a worldwide pop culture phenomenon. The franchise has been expanded into various films and other media, including television series, video games, novels, comic books, theme park attractions, and themed areas, comprising an all-encompassing fictional universe. Star Wars is one of the highest-grossing media franchises of all time.\nThe original 1977 film, retroactively subtitled Episode IV: A New Hope, was followed by the sequels Episode V: The Empire Strikes Back (1980) and Episode VI: Return of the Jedi (1983), forming the original Star Wars trilogy. Lucas later returned to the series to write and direct a prequel trilogy, consisting of Episode I: The Phantom Menace (1999), Episode II: Attack of the Clones (2002), and Episode III: Revenge of the Sith (2005). In 2012, Lucas sold his production company to Disney, relinquishing his ownership of the franchise. This led to a sequel trilogy, consisting of Episode VII: The Force Awakens (2015), Episode VIII: The Last Jedi (2017), and Episode IX: The Rise of Skywalker (2019).\nAll nine films, collectively referred to as the \"Skywalker Saga\", were nominated for Academy Awards, with Oscars going to the first three releases. Together with the theatrical live action \"anthology\" films Rogue One (2016) and Solo (2018), the combined box office revenue of the films equate to over US$10 billion, making Star Wars the third-highest-grossing film franchise in cinematic history.",
    "categories": [
      "Category:Action film franchises",
      "Category:Action film series",
      "Category:Adventure film series",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles needing additional references",
      "Category:American epic films",
      "Category:American science fantasy films",
      "Category:Articles needing additional references from January 2020",
      "Category:Articles with short description",
      "Category:Epic fantasy films",
      "Category:Fantasy film franchises",
      "Category:Fiction about politics",
      "Category:Fiction about rebellions",
      "Category:Fiction about robots",
      "Category:Fiction about space warfare",
      "Category:Film series introduced in 1977",
      "Category:Films about telekinesis",
      "Category:Lucasfilm franchises",
      "Category:Mass media franchises introduced in 1977",
      "Category:Military fiction",
      "Category:Pages using Sister project links with hidden wikidata",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Pages using the EasyTimeline extension",
      "Category:Religion in science fiction",
      "Category:Science fantasy",
      "Category:Science fiction film franchises",
      "Category:Short description is different from Wikidata",
      "Category:Soft science fiction",
      "Category:Space opera",
      "Category:Star Wars",
      "Category:Topps franchises",
      "Category:Use American English from January 2023",
      "Category:Use mdy dates from January 2023",
      "Category:Webarchive template wayback links",
      "Category:Wikipedia indefinitely move-protected pages",
      "Category:Wikipedia indefinitely semi-protected pages"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i>",
      "page_image_free": "Star_wars2.svg",
      "wikibase-shortdesc": "American epic space opera media franchise",
      "wikibase_item": "Q462"
    },
    "requested_title": "Imperial Snow Walker",
    "resolved_title": "Star Wars"
  },
  {
    "ok": true,
    "title": "Star Wars",
    "pageid": 26678,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars",
    "extract": "Star Wars is an American epic space opera media franchise created by George Lucas, which began with the eponymous 1977 film and quickly became a worldwide pop culture phenomenon. The franchise has been expanded into various films and other media, including television series, video games, novels, comic books, theme park attractions, and themed areas, comprising an all-encompassing fictional universe. Star Wars is one of the highest-grossing media franchises of all time.\nThe original 1977 film, retroactively subtitled Episode IV: A New Hope, was followed by the sequels Episode V: The Empire Strikes Back (1980) and Episode VI: Return of the Jedi (1983), forming the original Star Wars trilogy. Lucas later returned to the series to write and direct a prequel trilogy, consisting of Episode I: The Phantom Menace (1999), Episode II: Attack of the Clones (2002), and Episode III: Revenge of the Sith (2005). In 2012, Lucas sold his production company to Disney, relinquishing his ownership of the franchise. This led to a sequel trilogy, consisting of Episode VII: The Force Awakens (2015), Episode VIII: The Last Jedi (2017), and Episode IX: The Rise of Skywalker (2019).\nAll nine films, collectively referred to as the \"Skywalker Saga\", were nominated for Academy Awards, with Oscars going to the first three releases. Together with the theatrical live action \"anthology\" films Rogue One (2016) and Solo (2018), the combined box office revenue of the films equate to over US$10 billion, making Star Wars the third-highest-grossing film franchise in cinematic history.",
    "categories": [
      "Category:Action film franchises",
      "Category:Action film series",
      "Category:Adventure film series",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles needing additional references",
      "Category:American epic films",
      "Category:American science fantasy films",
      "Category:Articles needing additional references from January 2020",
      "Category:Articles with short description",
      "Category:Epic fantasy films",
      "Category:Fantasy film franchises",
      "Category:Fiction about politics",
      "Category:Fiction about rebellions",
      "Category:Fiction about robots",
      "Category:Fiction about space warfare",
      "Category:Film series introduced in 1977",
      "Category:Films about telekinesis",
      "Category:Lucasfilm franchises",
      "Category:Mass media franchises introduced in 1977",
      "Category:Military fiction",
      "Category:Pages using Sister project links with hidden wikidata",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Pages using the EasyTimeline extension",
      "Category:Religion in science fiction",
      "Category:Science fantasy",
      "Category:Science fiction film franchises",
      "Category:Short description is different from Wikidata",
      "Category:Soft science fiction",
      "Category:Space opera",
      "Category:Star Wars",
      "Category:Topps franchises",
      "Category:Use American English from January 2023",
      "Category:Use mdy dates from January 2023",
      "Category:Webarchive template wayback links",
      "Category:Wikipedia indefinitely move-protected pages",
      "Category:Wikipedia indefinitely semi-protected pages"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i>",
      "page_image_free": "Star_wars2.svg",
      "wikibase-shortdesc": "American epic space opera media franchise",
      "wikibase_item": "Q462"
    },
    "requested_title": "Imperial Star Destroyer",
    "resolved_title": "Star Wars"
  },
  {
    "ok": true,
    "title": "Star Wars Infinities",
    "pageid": 1956876,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Infinities",
    "extract": "Star Wars Infinities is a graphic novel trilogy published by Dark Horse Comics from 2002 to 2004. It tells a non-canon alternate version of each film in the original Star Wars trilogy in which a point of divergence occurs and changes the outcome of the story. Each individual Infinities story is unrelated to the others and is set within the timeline of their original film.\n\n",
    "categories": [
      "Category:All articles needing additional references",
      "Category:Articles needing additional references from March 2025",
      "Category:Articles with short description",
      "Category:Comics based on Star Wars",
      "Category:Dark Horse Comics titles",
      "Category:Short description matches Wikidata"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars Infinities</i>",
      "wikibase-shortdesc": "Graphic novel trilogy",
      "wikibase_item": "Q283246"
    },
    "requested_title": "Jabba's Palace",
    "resolved_title": "Star Wars Infinities"
  },
  {
    "ok": true,
    "title": "List of Star Wars films",
    "pageid": 48544240,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_films",
    "extract": "The Star Wars franchise involves multiple live-action and animated films. The series was initially created as a trilogy set in medias res (partway through the plot) that was later expanded into a trilogy of trilogies, known as the \"Skywalker Saga\".\nThe original 1977 film Star Wars (later subtitled A New Hope) was followed by the sequels The Empire Strikes Back (1980) and Return of the Jedi (1983); these films form the original trilogy. Beginning twenty-two years later, the prequel trilogy was released, consisting of Star Wars: Episode I – The Phantom Menace (1999), Star Wars: Episode II – Attack of the Clones (2002), and Star Wars: Episode III – Revenge of the Sith (2005). Then, after creator George Lucas sold Lucasfilm to Disney in 2012, a sequel trilogy consisting of Episodes VII through IX was released, namely Star Wars: The Force Awakens (2015), Star Wars: The Last Jedi (2017), and Star Wars: The Rise of Skywalker (2019).\nThe first three spin-off films produced were the made-for-television Star Wars Holiday Special (1978), The Ewok Adventure (1984) and Ewoks: The Battle for Endor (1985). Following Disney's 2012 acquisition of the franchise, these earlier films were dropped from the official canon, but the theatrical animated film Star Wars: The Clone Wars (2008) and its television series continuation retain their canonical status. Two standalone films were produced and released between the sequel trilogy films: Rogue One (2016) and Solo: A Star Wars Story (2018), both set between the original and prequel trilogies. A years long hiatus began in late 2019, during which numerous films were announced and often shelved. The Mandalorian and Grogu, a continuation of the similarly titled television series, is being directed by Jon Favreau and is planned for release in May 2026.\nThe combined box office revenue of the films amounts to over US$10 billion, and it is currently the third-highest-grossing film franchise. The major live-action releases (including all of the films of the Skywalker Saga) were nominated for Academy Awards. The original film was nominated for most of the major categories, including Best Picture, Best Director, Best Original Screenplay, and Best Supporting Actor for Alec Guinness (who played Obi-Wan Kenobi), while all theatrical live-action films have been nominated for particular categories. Several official Star Wars television series have also been released, all now on Disney+.",
    "categories": [
      "Category:All Wikipedia articles written in American English",
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from March 2025",
      "Category:CS1 maint: multiple names: authors list",
      "Category:Lists of films by franchise",
      "Category:Official website not in Wikidata",
      "Category:Pages using infobox film with nonstandard dates",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars films",
      "Category:Star Wars lists",
      "Category:Use American English from September 2019",
      "Category:Use mdy dates from September 2019"
    ],
    "pageprops": {
      "defaultsort": "Star Wars films",
      "displaytitle": "List of <i>Star Wars</i> films",
      "page_image_free": "Star_Wars_Yellow_Logo.svg",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q21527419"
    },
    "requested_title": "Jabba's Throne Room",
    "resolved_title": "List of Star Wars films"
  },
  {
    "ok": true,
    "title": "Star Wars sources and analogues",
    "pageid": 380358,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_sources_and_analogues",
    "extract": "The Star Wars space fantasy media franchise is acknowledged to have been inspired by multiple sources. These include Hinduism, Buddhism, Qigong, philosophy, classical mythology, Roman history, Gnosticism, Zoroastrianism, parts of the other Abrahamic religions, Confucianism, Shintō and Taoism, and countless cinematic precursors. Creator George Lucas stated \"Most of the spiritual reality in the movie[s] is based on a synthesis of all religions. A synthesis through history; the way man has perceived the unknown and the great mystery and tried to deal with that or dealing with it\".\nLucas has also said that chivalry, knighthood, paladinism and related institutions in feudal societies inspired some concepts in the Star Wars films, most notably the Jedi Knights. The work of the mythologist Joseph Campbell, especially his book The Hero with a Thousand Faces, directly influenced Lucas, and is what drove him to create the \"modern myth\" of Star Wars. The natural flow of energy known as the Force is believed to have originated from the concept of qi/chi/ki, \"the all-pervading vital energy of the universe\".\nTo celebrate the 30th anniversary of Star Wars, The History Channel premiered a two-hour event covering the entire Star Wars saga entitled Star Wars: The Legacy Revealed. Featuring interviews from the likes of Stephen Colbert, Newt Gingrich, Nancy Pelosi, Tom Brokaw, Dan Rather, Peter Jackson, acclaimed scholars and others, the program delved further into the Heroic Epic concept and the influences of mythology and other motifs that were important in making Star Wars. Subjects include sins of the father and redeeming the father, coming of age, exiting the ordinary world and others.\n\n",
    "categories": [
      "Category:All articles needing additional references",
      "Category:All articles that may contain original research",
      "Category:All articles with failed verification",
      "Category:All articles with specifically marked weasel-worded phrases",
      "Category:All articles with unsourced statements",
      "Category:All pages needing cleanup",
      "Category:Articles needing additional references from May 2011",
      "Category:Articles needing cleanup from March 2025",
      "Category:Articles that may contain original research from May 2021",
      "Category:Articles with failed verification from September 2025",
      "Category:Articles with multiple maintenance issues",
      "Category:Articles with sections that need to be turned into prose from March 2025",
      "Category:Articles with short description",
      "Category:Articles with specifically marked weasel-worded phrases from May 2011",
      "Category:Articles with unsourced statements from April 2018",
      "Category:Articles with unsourced statements from June 2021",
      "Category:CS1: unfit URL",
      "Category:Issues of cultural influence",
      "Category:Pages with duplicate reference names",
      "Category:Pages with reference errors",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars",
      "Category:Use mdy dates from November 2020",
      "Category:Wikipedia articles needing clarification from December 2015",
      "Category:Wikipedia articles needing clarification from May 2023"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i> sources and analogues",
      "page_image_free": "Flash_Gordon_(1940)_-_Opening_Crawl.jpg",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q7601180"
    },
    "requested_title": "Kenobi's Dwelling",
    "resolved_title": "Star Wars sources and analogues"
  },
  {
    "ok": true,
    "title": "Star Wars Jedi: Survivor",
    "pageid": 70886321,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Jedi:_Survivor",
    "extract": "Star Wars Jedi: Survivor is a 2023 action-adventure game developed by Respawn Entertainment and published by Electronic Arts. The game is the sequel to Star Wars Jedi: Fallen Order (2019), taking place five years after the events of the previous game and continuing the adventure of young Jedi Knight Cal Kestis (Cameron Monaghan), as he and his friends continue in their struggle to survive the tyranny of the Galactic Empire while racing against a corrupted High Republic Jedi to reach a shrouded planet that can serve as a safe haven for those oppressed by the Empire. As with its predecessor, Survivor's structure was inspired by Metroidvania games, with gameplay split between combating hostile enemies using Cal's lightsaber and Force powers, platforming, and puzzle-solving.\nDevelopment of the game began in late 2019 and lasted for three and a half years, with Stig Asmussen once again serving as the game's director. It was the last game released by EA during its 10-year exclusivity contract with Lucasfilm to produce Star Wars games. With the sequel, the goal for the team was to significantly expand its scope and scale, refining mechanics established in Fallen Order while introducing new gameplay features such as AI-controlled companions. The team collaborated closely with Lucasfilm while writing the game's narrative, which had a significantly darker tone when compared with Fallen Order. In Survivor, Cal grapples with the futility of the rebellion and the dominance of the Empire while facing several antagonists that serve as foils.\nAnnounced in May 2022, Star Wars Jedi: Survivor was released for PlayStation 5, Windows, and Xbox Series X/S on April 28, 2023. Versions for PlayStation 4 and Xbox One were released on September 17, 2024. The game was met with positive reviews from critics, who praised the characters, combat, level design, and music, with most deeming it a significant improvement over its predecessor. The PC version of the game, however, was criticized for its technical issues. It was a commercial success for the publisher, and it was nominated for multiple year-end awards, including Best Action/Adventure Game at The Game Awards 2023 and Adventure Game of the Year at the 27th Annual D.I.C.E. Awards. A sequel, which also serves as a conclusion to Cal's story, is in development.",
    "categories": [
      "Category:2023 video games",
      "Category:Action-adventure games",
      "Category:All Wikipedia articles written in American English",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Commons category link from Wikidata",
      "Category:Electronic Arts games",
      "Category:Good articles",
      "Category:Pages using multiple image with auto scaled images",
      "Category:PlayStation 4 Pro enhanced games",
      "Category:PlayStation 4 games",
      "Category:PlayStation 5 Pro enhanced games",
      "Category:PlayStation 5 games",
      "Category:Respawn Entertainment games",
      "Category:Short description is different from Wikidata",
      "Category:Single-player video games",
      "Category:Soulslike video games",
      "Category:Space opera video games",
      "Category:Star Wars: The High Republic",
      "Category:Star Wars Jedi (series)",
      "Category:Star Wars video games",
      "Category:Unreal Engine 4 games",
      "Category:Use American English from December 2022",
      "Category:Use mdy dates from April 2023",
      "Category:Video games developed in the United States",
      "Category:Windows games",
      "Category:Xbox One X enhanced games",
      "Category:Xbox One games",
      "Category:Xbox Series X and Series S games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars Jedi: Survivor</i>",
      "page_image": "Star_Wars_Jedi_Survivor.jpg",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "2023 video game",
      "wikibase_item": "Q112704136"
    },
    "requested_title": "Landing Platform",
    "resolved_title": "Star Wars Jedi: Survivor"
  },
  {
    "ok": true,
    "title": "Star Wars: Episode III – Revenge of the Sith",
    "pageid": 55447,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Episode_III_%E2%80%93_Revenge_of_the_Sith",
    "extract": "Star Wars: Episode III – Revenge of the Sith is a 2005 American epic space opera film written and directed by George Lucas. The sequel to Attack of the Clones (2002), it is the sixth film in the Star Wars film series, the third installment in the Star Wars prequel trilogy, and third chronological chapter of the \"Skywalker Saga\". The film stars Ewan McGregor, Natalie Portman, Hayden Christensen, Ian McDiarmid, Samuel L. Jackson, Christopher Lee, Anthony Daniels, Kenny Baker, and Frank Oz.\nRevenge of the Sith is set three years after the onset of the Clone Wars, as established in Attack of the Clones, which depicts the rise of Darth Sidious and the Galactic Empire as well as Anakin Skywalker turning to the dark side of the Force, which will have wide-ranging consequences in the galaxy that lead to the extermination of the Jedi.\nLucas began writing the script before production of Attack of the Clones ended, saying he wanted the end of the trilogy to be similar to a romantic tragedy, thus leading into Darth Vader's state at the beginning of the next film. Production of Revenge of the Sith started in June 2003, and filming took place in Australia, Thailand, Switzerland, China, Italy, and the United Kingdom.\nRevenge of the Sith premiered on May 16, 2005, at the Cannes Film Festival, and was theatrically released in the United States on May 19. The film received mostly positive reviews from critics, with praise for the mature themes, darker tone, emotional depth, soundtrack and action sequences, although some criticism was reserved towards Lucas's screenplay; many consider it the best installment of the prequel trilogy. It broke several box-office records during its opening week and earned $850 million worldwide during its initial run, making it the second-highest-grossing film in the Star Wars franchise at the time. It was the highest-grossing film in the U.S. and the second-highest-grossing film worldwide in 2005. It also holds the record for the highest opening-day gross on a Thursday, at $50 million. It was the last Star Wars film distributed by 20th Century Fox, although the company (and, by extension, the film) was acquired by Disney several years after it acquired Lucasfilm.",
    "categories": [
      "Category:2000s American films",
      "Category:2000s English-language films",
      "Category:2000s adventure films",
      "Category:2000s pregnancy films",
      "Category:2000s science fiction adventure films",
      "Category:2005 films",
      "Category:2005 science fiction action films",
      "Category:20th Century Fox films",
      "Category:4DX films",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles lacking reliable references",
      "Category:American epic fantasy films",
      "Category:American films about revenge",
      "Category:American pregnancy films",
      "Category:American prequel films",
      "Category:American science fantasy films",
      "Category:American science fiction action films",
      "Category:American science fiction war films",
      "Category:American sequel films",
      "Category:Articles lacking reliable references from December 2019",
      "Category:Articles with short description",
      "Category:English-language science fiction action films",
      "Category:English-language science fiction adventure films",
      "Category:Fiction about genocide",
      "Category:Films about coups d'état",
      "Category:Films directed by George Lucas",
      "Category:Films produced by Rick McCallum",
      "Category:Films scored by John Williams",
      "Category:Films shot at Elstree Film Studios",
      "Category:Films shot at Shepperton Studios",
      "Category:Films shot in China",
      "Category:Films shot in Italy",
      "Category:Films shot in Switzerland",
      "Category:Films shot in Sydney",
      "Category:Films shot in Thailand",
      "Category:Films using motion capture",
      "Category:Films with screenplays by George Lucas",
      "Category:Golden Raspberry Award–winning films",
      "Category:IMDb ID (Cite Mojo) different from Wikidata",
      "Category:Interquel films",
      "Category:Lucasfilm films",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Saturn Award–winning films",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars: Episode III – Revenge of the Sith",
      "Category:Star Wars Skywalker Saga films",
      "Category:Teen Choice Award winning films",
      "Category:Template film date with 2 release dates",
      "Category:Use American English from May 2024",
      "Category:Use mdy dates from May 2024",
      "Category:Webarchive template wayback links",
      "Category:Wikipedia pending changes protected pages",
      "Category:Works featuring villain protagonists"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Episode 3: Revenge of the Sith",
      "displaytitle": "<i>Star Wars: Episode III – Revenge of the Sith</i>",
      "page_image": "Star_Wars_Episode_III_Revenge_of_the_Sith_poster.jpg",
      "wikibase-shortdesc": "2005 film by George Lucas",
      "wikibase_item": "Q42051"
    },
    "requested_title": "Lars Homestead",
    "resolved_title": "Star Wars: Episode III – Revenge of the Sith"
  },
  {
    "ok": true,
    "title": "Star Wars (comic strip)",
    "pageid": 60487081,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_(comic_strip)",
    "extract": "A Star Wars comic strip ran in both daily strips and Sunday strips, originally distributed between 1979 and 1984 by two American newspaper publishers, the Los Angeles Times Syndicate and Watertown Daily Times.\nThe comics are set between the original Star Wars film and The Empire Strikes Back, with the exception of an adaptation of Brian Daley's Han Solo at Stars' End (1979). The first run, by Russ Manning, was primarily created before the release of The Empire Strikes Back, while Archie Goodwin and Al Williamson, in their storylines, worked with the benefit of having seen both films, in addition to Return of the Jedi in 1983.\nIn 1991, Russ Cochran published a 2500-copy limited run of a three-volume hardcover boxset of all of Goodwin and Williamson's Star Wars comic strips from between 1981 and 1984. From 1992 to 1994, Dark Horse Comics collected colorized compilations of the newspaper strip in its Classic Star Wars series. Between 2017 and 2018, The Library of American Comics and IDW Publishing published a three-volume reprint series of the complete comic strip.\n\n",
    "categories": [
      "Category:1979 comics debuts",
      "Category:1984 comics endings",
      "Category:2017 comics debuts",
      "Category:2018 comics endings",
      "Category:Comic strip collection books",
      "Category:Comics based on Star Wars",
      "Category:Comics based on films",
      "Category:Comics by Archie Goodwin (comics)",
      "Category:Eisner Award winners",
      "Category:Marvel Comics titles",
      "Category:Science fiction comic strips",
      "Category:The Library of American Comics publications",
      "Category:Use mdy dates from July 2020"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i> (comic strip)",
      "page_image": "Star_Wars_-_The_Complete_Classic_Newspaper_Comics,_Vol._1.jpg",
      "wikibase_item": "Q65056788"
    },
    "requested_title": "Lifepod",
    "resolved_title": "Star Wars (comic strip)"
  },
  {
    "ok": true,
    "title": "Star Wars: From the Adventures of Luke Skywalker",
    "pageid": 4936526,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_From_the_Adventures_of_Luke_Skywalker",
    "extract": "Star Wars: From the Adventures of Luke Skywalker is the novelization of the 1977 film Star Wars, ghostwritten by American author Alan Dean Foster, but credited to director George Lucas. It was first published on November 12, 1976, by Ballantine Books, several months before the release of the film. In later years, it was republished under the title Star Wars: A New Hope to reflect the retroactive addition of a subtitle to the film in 1981.\nThe prologue includes references to Palpatine and his rise to power, setting up the backstory for future films. The book also contains some differences from the film.",
    "categories": [
      "Category:1976 American novels",
      "Category:1976 science fiction novels",
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from May 2020",
      "Category:Ballantine Books books",
      "Category:Novels based on films",
      "Category:Novels by Alan Dean Foster",
      "Category:Novels set in deserts",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars (film)",
      "Category:Star Wars novels",
      "Category:Use mdy dates from December 2015"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: From The Adventures Of Luke Skywalker",
      "displaytitle": "<i>Star Wars: From the Adventures of Luke Skywalker</i>",
      "page_image": "StarWarsNovelization.jpg",
      "wikibase-shortdesc": "1976 novel by Alan Dean Foster",
      "wikibase_item": "Q6272668"
    },
    "requested_title": "Luke's Cockpit",
    "resolved_title": "Star Wars: From the Adventures of Luke Skywalker"
  },
  {
    "ok": true,
    "title": "Star Wars Rogue Squadron II: Rogue Leader",
    "pageid": 1522499,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Rogue_Squadron_II:_Rogue_Leader",
    "extract": "Star Wars Rogue Squadron II: Rogue Leader is a flight action game developed by Factor 5 and LucasArts and published by LucasArts for the GameCube. The second installment of the Rogue Squadron series, it was released as a launch title for the console in North America on November 18, 2001, Europe on May 3, 2002, and Australia on May 17, 2002. Set in the fictional Star Wars galaxy, the game spans all three original trilogy Star Wars films. The player controls either Luke Skywalker or Wedge Antilles. As the game progresses, Skywalker, Antilles and the Rebel Alliance fight the Galactic Empire in ten missions across various planets.\nThe game received critical acclaim from critics who praised the game's graphics, sound and gameplay, though the lack of multiplayer was criticised. The third and last game in the series, Star Wars Rogue Squadron III: Rebel Strike, was released in 2003 for the GameCube.",
    "categories": [
      "Category:2001 video games",
      "Category:Action games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Factor 5 games",
      "Category:GameCube-only games",
      "Category:GameCube games",
      "Category:Sequel video games",
      "Category:Short description matches Wikidata",
      "Category:Single-player video games",
      "Category:Star Wars: Rogue Squadron games",
      "Category:Use mdy dates from August 2025",
      "Category:Video games developed in the United States",
      "Category:Video games scored by Chris Huelsbeck",
      "Category:Video games with commentaries"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Rogue Squadron II: Rogue Leader",
      "displaytitle": "<i>Star Wars Rogue Squadron II: Rogue Leader</i>",
      "page_image": "Rogue_squadron_2_Box.jpg",
      "wikibase-shortdesc": "2001 video game",
      "wikibase_item": "Q54307"
    },
    "requested_title": "Luke's Snowspeeder, Rogue Leader",
    "resolved_title": "Star Wars Rogue Squadron II: Rogue Leader"
  },
  {
    "ok": true,
    "title": "Star Wars: The Rise of Skywalker",
    "pageid": 43910733,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_The_Rise_of_Skywalker",
    "extract": "Star Wars: The Rise of Skywalker (also known as Star Wars: Episode IX – The Rise of Skywalker) is a 2019 American epic space opera film produced, co-written, and directed by J. J. Abrams. Produced by Lucasfilm and Bad Robot, and distributed by Walt Disney Studios Motion Pictures, it is the third installment of the Star Wars sequel trilogy, following The Force Awakens (2015) and The Last Jedi (2017), and the final episode of the nine-part \"Skywalker saga\". Its cast includes Carrie Fisher, Mark Hamill, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Anthony Daniels, Naomi Ackie, Domhnall Gleeson, Richard E. Grant, Lupita Nyong'o, Keri Russell, Joonas Suotamo, Kelly Marie Tran, Ian McDiarmid, and Billy Dee Williams. The film follows Rey, Finn, and Poe Dameron as they lead the remnants of the Resistance in a final stand against Supreme Leader Kylo Ren and the First Order, who are now allied by the resurrected Sith Lord, Emperor Palpatine, Rey's paternal grandfather.\nFollowing initial reports that The Last Jedi director Rian Johnson would write the script for Episode IX, in August 2015, Colin Trevorrow was hired to direct and to write a script with his collaborator Derek Connolly; both ultimately retain story credit with Abrams and Chris Terrio. In September 2017, Trevorrow left the project following creative differences with producer Kathleen Kennedy, and Abrams returned as director. John Williams, composer for the previous episodic films, returned to compose the score, making it his final score for the franchise. Principal photography began in August 2018 at Pinewood Studios in England and wrapped in February 2019, with post-production completed in November 2019. With a net budget of approximately $489.9 million, it is the most expensive film ever made.\nThe Rise of Skywalker premiered in Hollywood, Los Angeles, on December 16, 2019, and was released in the United States on December 20. The film received mixed reviews from critics, and grossed $1.077 billion, making it the seventh-highest-grossing film of 2019, but the lowest-grossing of the trilogy. It received three nominations at the 92nd Academy Awards (Best Original Score, Best Visual Effects, and Best Sound Editing) as well as three at the 73rd British Academy Film Awards (also Best Special Visual Effects, Best Original Music, and Best Sound). It won five awards at the 46th Saturn Awards, including Best Science Fiction Film.\n\n",
    "categories": [
      "Category:2010s American films",
      "Category:2010s English-language films",
      "Category:2010s science fantasy films",
      "Category:2019 3D films",
      "Category:2019 LGBTQ-related films",
      "Category:2019 films",
      "Category:2019 science fiction action films",
      "Category:4DX films",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles with style issues",
      "Category:American 3D films",
      "Category:American IMAX films",
      "Category:American LGBTQ-related films",
      "Category:American epic fantasy films",
      "Category:American films about revenge",
      "Category:American science fantasy films",
      "Category:American science fiction action films",
      "Category:American science fiction war films",
      "Category:American sequel films",
      "Category:Articles with short description",
      "Category:Bad Robot Productions films",
      "Category:CS1: unfit URL",
      "Category:Censored films",
      "Category:Disney and LGBTQ",
      "Category:English-language science fiction action films",
      "Category:Films about resurrection",
      "Category:Films directed by J. J. Abrams",
      "Category:Films produced by J. J. Abrams",
      "Category:Films produced by Kathleen Kennedy",
      "Category:Films scored by John Williams",
      "Category:Films shot at Pinewood Studios",
      "Category:Films shot in Buckinghamshire",
      "Category:Films shot in England",
      "Category:Films shot in Jordan",
      "Category:Films using motion capture",
      "Category:Films with archival recordings",
      "Category:Films with screenplays by Chris Terrio",
      "Category:Films with screenplays by Colin Trevorrow",
      "Category:Films with screenplays by Derek Connolly",
      "Category:Films with screenplays by J. J. Abrams",
      "Category:Good articles",
      "Category:IMDb ID (Cite Mojo) different from Wikidata",
      "Category:Lucasfilm films",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Pages using Sister project links with hidden wikidata",
      "Category:Saturn Award–winning films",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars Skywalker Saga films",
      "Category:Template film date with 2 release dates",
      "Category:Use American English from October 2025",
      "Category:Use mdy dates from October 2025",
      "Category:Wikipedia articles with style issues from September 2023",
      "Category:Wikipedia indefinitely move-protected pages"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: The Rise of Skywalker",
      "displaytitle": "<i>Star Wars: The Rise of Skywalker</i>",
      "page_image": "Star_Wars_The_Rise_of_Skywalker_poster.jpg",
      "toc": "",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "2019 film by J. J. Abrams",
      "wikibase_item": "Q20977110"
    },
    "requested_title": "Luke's X-Wing",
    "resolved_title": "Star Wars: The Rise of Skywalker"
  },
  {
    "ok": true,
    "title": "Star Wars Jedi: Fallen Order",
    "pageid": 57645522,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Jedi:_Fallen_Order",
    "extract": "Star Wars Jedi: Fallen Order is a 2019 action-adventure game developed by Respawn Entertainment and published by Electronic Arts. The story is set in the Star Wars universe, five years after Star Wars: Episode III – Revenge of the Sith. It follows Cal Kestis, a Jedi Padawan who becomes a target of the Galactic Empire and is hunted throughout the galaxy by the Imperial Inquisitors while attempting to complete his training, reconcile with his troubled past, and rebuild the fallen Jedi Order. The player can use Kestis' lightsaber and Force powers to defeat enemies, including stormtroopers, wild beasts and bounty hunters. The game adopts a Metroidvania-style level design where new areas are accessed as Cal unlocks skills and abilities.\nStar Wars Jedi: Fallen Order was directed by Stig Asmussen, who joined Respawn in 2014. The game began development as an original title unrelated to Star Wars, but Electronic Arts felt the action would work well as a Star Wars game, convincing Lucasfilm to authorize and consult on the project. The game's visuals were influenced by Rogue One and Star Wars Rebels, while the combat and levels were inspired by Metroid Prime, Dark Souls, and The Legend of Zelda: The Wind Waker. The game's voice cast includes Cameron Monaghan as Cal Kestis and Debra Wilson as his mentor Cere Junda. Ben Burtt provided the voice for Cal's companion droid BD-1, while Forest Whitaker reprised his role from Rogue One as Saw Gerrera. The music, composed by Stephen Barton and Gordy Haab, was recorded at Abbey Road Studios with the London Symphony Orchestra and the Bach Choir of London.\nStar Wars Jedi: Fallen Order was released for PlayStation 4, Windows, and Xbox One in November 2019, and for PlayStation 5 and Xbox Series X/S in June 2021. The game received generally favorable reviews from critics, who praised the game's combat, characters, performance, and world design, though it received criticisms for the technical issues at release. It sold over 10 million units by 2020. It was nominated for several end-of-the-year accolades, including Best Action/Adventure Game at The Game Awards 2020, as well as won several awards including Adventure Game of the Year at the 23rd Annual D.I.C.E. Awards. A sequel, Star Wars Jedi: Survivor, was released in April 2023.",
    "categories": [
      "Category:2019 video games",
      "Category:Action-adventure games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:CS1 Spanish-language sources (es)",
      "Category:Commons category link from Wikidata",
      "Category:Electronic Arts games",
      "Category:Good articles",
      "Category:Metroidvania games",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Pages using multiple image with auto scaled images",
      "Category:PlayStation 4 Pro enhanced games",
      "Category:PlayStation 4 games",
      "Category:PlayStation 5 games",
      "Category:Respawn Entertainment games",
      "Category:Science fiction video games",
      "Category:Short description is different from Wikidata",
      "Category:Single-player video games",
      "Category:Soulslike video games",
      "Category:Space opera video games",
      "Category:Stadia games",
      "Category:Star Wars Jedi (series)",
      "Category:Star Wars video games",
      "Category:Unreal Engine 4 games",
      "Category:Use mdy dates from December 2022",
      "Category:Video games developed in the United States",
      "Category:Video games scored by Stephen Barton",
      "Category:Windows games",
      "Category:Xbox One games",
      "Category:Xbox Series X and Series S games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars Jedi: Fallen Order</i>",
      "page_image": "Cover_art_of_Star_Wars_Jedi_Fallen_Order.jpg",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "2019 video game",
      "wikibase_item": "Q55449345"
    },
    "requested_title": "Main Gate And Hall",
    "resolved_title": "Star Wars Jedi: Fallen Order"
  },
  {
    "ok": true,
    "title": "Star Wars: Episode III – Revenge of the Sith (video game)",
    "pageid": 1856187,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Episode_III_%E2%80%93_Revenge_of_the_Sith_(video_game)",
    "extract": "Star Wars: Episode III – Revenge of the Sith is an action video game based on the 2005 film of the same name. It was released on May 5, 2005, for the PlayStation 2, Xbox, Game Boy Advance, Nintendo DS, and Symbian OS. For the Xbox 360's backwards compatible lineup, Revenge of the Sith is one out of the 400+ backwards compatible games for the 360. As part of the PlayStation 2 classics program, the PlayStation 2 version was re-released in Europe on the PlayStation Network on February 11, 2015, and in North America on April 28, 2015 for PlayStation 3. Meanwhile, the Xbox version was also added to the backwards compatibility list for the Xbox One and Xbox Series X/S on November 15, 2021. A PlayStation Portable version was in development, but was cancelled. It received mixed reviews from critics.",
    "categories": [
      "Category:2005 video games",
      "Category:3D beat 'em ups",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:Cancelled PlayStation Portable games",
      "Category:Game Boy Advance games",
      "Category:Hack and slash games",
      "Category:LucasArts games",
      "Category:Multiplayer and single-player video games",
      "Category:Nintendo DS games",
      "Category:PlayStation 2 games",
      "Category:PlayStation Network games",
      "Category:Short description matches Wikidata",
      "Category:Space opera video games",
      "Category:Star Wars video games",
      "Category:Symbian games",
      "Category:The Collective (company) games",
      "Category:Ubisoft games",
      "Category:Video game prequels",
      "Category:Video games developed in Canada",
      "Category:Video games developed in the United States",
      "Category:Video games scored by Ellen Meijers",
      "Category:Xbox games"
    ],
    "pageprops": {
      "defaultsort": "Star Wars Episode Iii: Revenge Of The Sith (Video Game)",
      "displaytitle": "<i>Star Wars: Episode III – Revenge of the Sith</i> (video game)",
      "page_image": "Star_Wars_Episode_III_cover.png",
      "wikibase-shortdesc": "2005 video game",
      "wikibase_item": "Q54846"
    },
    "requested_title": "Main Hangar",
    "resolved_title": "Star Wars: Episode III – Revenge of the Sith (video game)"
  },
  {
    "ok": true,
    "title": "Star Wars: The Old Republic",
    "pageid": 19879390,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_The_Old_Republic",
    "extract": "Star Wars: The Old Republic is a massively multiplayer online role-playing game (MMORPG) based in the Star Wars fictional universe. Developed by BioWare Austin and a supplemental team at BioWare Edmonton, the game was announced on October 21, 2008. The video game was released for the Microsoft Windows platform on December 20, 2011 in North America and part of Europe. It was released in Oceania and Asia on March 1, 2012.\nThis story takes place in the Star Wars universe shortly after the establishment of a tenuous peace between the re-emergent Sith Empire and the Galactic Republic. The game features eight different classes. Each of the eight classes has a three act storyline that progresses as the character levels up. Players join either the Republic or the Sith, but players may possess a morality at any point along the light/dark spectrum. Different classes favor different styles of gameplay, and the game features extensive customization options, fully voiced dialogue, companion characters, and dialogue options similar to BioWare's other role-playing games.\nAlthough not officially disclosed, based on estimates, it is one of the most developmentally expensive games made. The game had one million subscribers within three days of its launch, making it the world's \"fastest-growing MMO ever\"; however, in the following months the game lost a fair share of its subscriptions, but has remained profitable. The game has since adopted the hybrid free-to-play business model with remaining subscription option. The game was met with positive reception upon release and has received several updates and expansion packs. Several books and comics based on the game have been released. It is estimated that the game made $139 million in additional revenues on top of the subscription income in 2013. In an earnings call to investors in October 2019, Electronic Arts announced that Star Wars: The Old Republic was closing in on a billion dollars in lifetime revenue, making it a financial success based on the reported $200 million development budget.\n\n",
    "categories": [
      "Category:2011 video games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:BioWare games",
      "Category:Free-to-play video games",
      "Category:LucasArts games",
      "Category:MacOS games",
      "Category:Massively multiplayer online role-playing games",
      "Category:Science fiction massively multiplayer online role-playing games",
      "Category:Short description matches Wikidata",
      "Category:Space opera video games",
      "Category:Star Wars: Knights of the Old Republic",
      "Category:Star Wars video games",
      "Category:Use mdy dates from January 2016",
      "Category:Video games developed in the United States",
      "Category:Video games scored by Jason Graves",
      "Category:Video games scored by Lennie Moore",
      "Category:Video games scored by Mark Griskey",
      "Category:Windows-only games",
      "Category:Windows games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: The Old Republic</i>",
      "page_image": "Star_Wars-_The_Old_Republic_cover.jpg",
      "wikibase-shortdesc": "2011 video game",
      "wikibase_item": "Q737308"
    },
    "requested_title": "Massassi",
    "resolved_title": "Star Wars: The Old Republic"
  },
  {
    "ok": true,
    "title": "Star Wars: Galactic Battlegrounds",
    "pageid": 1085317,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Galactic_Battlegrounds",
    "extract": "Star Wars: Galactic Battlegrounds is a real-time strategy video game set in the Star Wars universe. It was developed by LucasArts and Ensemble Studios. It was released in November 2001. An expansion pack, Clone Campaigns, was released on May 14, 2002, adding two new factions and campaigns. Later that year, both Galactic Battlegrounds and Clone Campaigns were released in a box set, Star Wars: Galactic Battlegrounds Saga.\nThe games were built on the Genie engine by Ensemble Studios, the same one used in Age of Empires and Age of Empires II.",
    "categories": [
      "Category:2001 video games",
      "Category:All articles needing additional references",
      "Category:Articles needing additional references from February 2008",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Aspyr games",
      "Category:CS1 maint: bot: original URL status unknown",
      "Category:Classic Mac OS games",
      "Category:Genie Engine games",
      "Category:LucasArts games",
      "Category:MacOS games",
      "Category:Multiplayer and single-player video games",
      "Category:Real-time strategy video games",
      "Category:Short description matches Wikidata",
      "Category:Star Wars video games",
      "Category:Video games developed in the United States",
      "Category:Windows games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: Galactic Battlegrounds</i>",
      "page_image": "Swgbbox.jpg",
      "wikibase-shortdesc": "2001 video game",
      "wikibase_item": "Q1194920"
    },
    "requested_title": "Massassi Outpost",
    "resolved_title": "Star Wars: Galactic Battlegrounds"
  },
  {
    "ok": true,
    "title": "Millennium Falcon",
    "pageid": 23861227,
    "fullurl": "https://en.wikipedia.org/wiki/Millennium_Falcon",
    "extract": "The Millennium Falcon is a fictional starship in the Star Wars franchise. Designed by Joe Johnston for the film Star Wars (1977), it has subsequently appeared in The Star Wars Holiday Special (1978), The Empire Strikes Back (1980), Return of the Jedi (1983), Revenge of the Sith (2005), The Force Awakens (2015), The Last Jedi (2017), Solo: A Star Wars Story (2018), and The Rise of Skywalker (2019). Additionally, the Falcon appears in a variety of Star Wars spin-off works, including books, comics, and games; James Luceno's novel Millennium Falcon focuses on the titular ship. It also appears in the 2014 animated film The Lego Movie in Lego form.\nThe ship, a YT-1300 Corellian light freighter, is primarily commanded by smuggler Han Solo and his Wookiee first mate, Chewbacca, and was previously owned by gambler/con-artist Lando Calrissian. Solo: A Star Wars Story depicts the ship as being co-piloted by, and later integrated with, Calrissian's droid L3-37. Described as being one of the fastest vessels in the Star Wars canon, the Falcon looks worn-out but despite its humble origins and shabby exterior, the Millennium Falcon has played a critical role in some of the greatest victories of the Rebel Alliance and the New Republic.",
    "categories": [
      "Category:All articles needing additional references",
      "Category:Articles needing additional references from December 2009",
      "Category:Articles with short description",
      "Category:Fiction about faster-than-light travel",
      "Category:Fictional elements introduced in 1977",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars spacecraft",
      "Category:Use mdy dates from December 2015"
    ],
    "pageprops": {
      "displaytitle": "<i>Millennium Falcon</i>",
      "page_image": "A_screenshot_from_Star_Wars_Episode_IV_A_New_Hope_depicting_the_Millennium_Falcon.jpg",
      "wikibase-shortdesc": "Fictional starship in the Star Wars franchise",
      "wikibase_item": "Q19901"
    },
    "requested_title": "Millennium Falcon",
    "resolved_title": "Millennium Falcon"
  },
  {
    "ok": true,
    "title": "Mos Eisley",
    "pageid": 34522646,
    "fullurl": "https://en.wikipedia.org/wiki/Mos_Eisley",
    "extract": "Mos Eisley is a spaceport town in the fictional Star Wars universe. Located on the planet Tatooine, it first appeared in the 1977 film Star Wars, described by the character Obi-Wan Kenobi (played by Alec Guinness) as a \"wretched hive of scum and villainy\".\nA notable scene set in a seedy Mos Eisley cantina crowded with numerous alien races made a particular impact on audiences. Location filming for the spaceport took place from 1975 to 1976 in Tunisia, with interiors filmed at Elstree Studios near London.\n\n",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from November 2019",
      "Category:Fictional elements introduced in 1977",
      "Category:Fictional populated places",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars locations",
      "Category:Use mdy dates from April 2023"
    ],
    "pageprops": {
      "page_image": "Mos_Eisley_Cantina.jpg",
      "wikibase-shortdesc": "Fictional city in Star Wars",
      "wikibase_item": "Q946074"
    },
    "requested_title": "Mos Eisley",
    "resolved_title": "Mos Eisley"
  },
  {
    "ok": true,
    "title": "List of Star Wars species (P–T)",
    "pageid": 6405018,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_species_(P%E2%80%93T)",
    "extract": "This is a list of Star Wars species, containing the names of fictional species from the Star Wars franchise beginning with the letters P to T. Star Wars is an American epic space opera film series created by George Lucas. The first film in the series, Star Wars, was released on May 25, 1977, and became a worldwide pop culture phenomenon, followed by five sequels and three prequels. Many species of alien creatures (often humanoid) are depicted. For the other species listed alphabetically, see the following:\n\nList of Star Wars species (A–E)\nList of Star Wars species (F–J)\nList of Star Wars species (K–O)\nList of Star Wars species (U–Z)",
    "categories": [
      "Category:All Wikipedia articles written in American English",
      "Category:All articles needing additional references",
      "Category:All articles that need to differentiate between fact and fiction",
      "Category:All articles with unsourced statements",
      "Category:Articles needing additional references from July 2007",
      "Category:Articles that need to differentiate between fact and fiction from January 2009",
      "Category:Articles with multiple maintenance issues",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from August 2023",
      "Category:Articles with unsourced statements from February 2007",
      "Category:Articles with unsourced statements from February 2009",
      "Category:Articles with unsourced statements from March 2024",
      "Category:Articles with unsourced statements from September 2022",
      "Category:Lists of fictional extraterrestrial species and races",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars articles that need to differentiate between fact and fiction",
      "Category:Star Wars species",
      "Category:Star Wars species lists",
      "Category:Use American English from September 2022",
      "Category:Use mdy dates from September 2022"
    ],
    "pageprops": {
      "defaultsort": "List Of Star Wars Species (P-T)",
      "displaytitle": "List of <i>Star Wars</i> species (P–T)",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q2637978"
    },
    "requested_title": "Mos Eisley Spaceport",
    "resolved_title": "List of Star Wars species (P–T)"
  },
  {
    "ok": true,
    "title": "Universe of Star Wars",
    "pageid": 79982081,
    "fullurl": "https://en.wikipedia.org/wiki/Universe_of_Star_Wars",
    "extract": "The Star Wars multimedia and film franchise is set in a fictional universe, most events of which occur in a single galaxy in that universe. Originally established by George Lucas as a \"galaxy far, far away\", it comprises numerous planets, moons, star systems, and species. The galaxy is divided into four broad sub-regions: the Core Worlds, Mid Rim, Outer Rim, and Unknown Regions. Notable planets include Coruscant, an ecumenopolis in the Core that functions as a political and cultural center, and Tatooine, a desert planet located in the Outer Rim. The universe initially encompassed a collection of works recognized as canon by Lucasfilm as part of the official Star Wars storyline. Subsequent expanded material in other media was later rebranded as the Legends universe by Disney, declaring it non-canonical to the official universe.\nWithin this fictional body exists a variety of intelligent species, including Humans, Twi’leks, Wookiees, Rodians, and Hutts, as well as several major governing bodies throughout galactic history, such as the Galactic Republic, Galactic Empire, Rebel Alliance, New Republic, and First Order. Each of these entities operates under differing political structures, ranging from democratic institutions to totalitarian regimes. Interstellar travel is facilitated by hyperspace, allowing rapid movement between distant star systems. A central metaphysical concept in the Star Wars universe is the Force, an omnipresent energy field that connects all living things. The Force is divided into two principal aspects: the Light Side, traditionally followed by the Jedi Order, and the Dark Side, embraced by the Sith. The universe also features a high level of technological advancement, including starships, droids, and energy-based weapons such as blasters and lightsabers. The timeline of in-universe events is often measured in reference to the Battle of Yavin, a pivotal conflict depicted in the original 1977 film, serving as a chronological anchor for subsequent developments in the franchise.",
    "categories": [
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:CS1 maint: bot: original URL status unknown",
      "Category:Fictional universes",
      "Category:Harv and Sfn no-target errors",
      "Category:Lucasfilm",
      "Category:Mass media franchises introduced in 1977",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Science fiction franchises",
      "Category:Short description is different from Wikidata",
      "Category:Space opera",
      "Category:Star Wars"
    ],
    "pageprops": {
      "displaytitle": "Universe of <i>Star Wars</i>",
      "page_image_free": "Star_Wars_in_Tunisia_-_Lars_Homestead_in_Chott_el_Djerid_(cropped).jpg",
      "wikibase-shortdesc": "Fictional universe of a media franchise",
      "wikibase_item": "Q19786052"
    },
    "requested_title": "Plain Of Hoth",
    "resolved_title": "Universe of Star Wars"
  },
  {
    "ok": true,
    "title": "X-wing fighter",
    "pageid": 50801,
    "fullurl": "https://en.wikipedia.org/wiki/X-wing_fighter",
    "extract": "The X-wing starfighter is a name applied to a family of fictional spacecraft manufactured by the Incom Corporation and later the Incom-FreiTek Corporation from the Star Wars franchise. Named for the distinctive shape made when its s-foils (wings) are in attack position, the X-wing was a class of starfighter used by the Rebel Alliance in their conflict with the Galactic Empire. It made its theatrical debut, as the T-65B model, in Star Wars (1977) as the spacecraft piloted by Luke Skywalker and the Red Squadron when Luke destroyed the Death Star. The starfighter featured extensively in the Star Wars original trilogy and in the Expanded Universe that followed, and has been merchandised as a variety of toys and models.\nStarting with The Force Awakens (2015), a new model of X-wing was introduced, which has gone on to play a prominent role in the Star Wars sequel trilogy. The T-70 X-wing, flown by the Resistance in their fight against the First Order, is depicted as the successor to the T-65. Although described as being an improvement over the original, in the expanded literature this new X-wing is itself considered outdated, having been replaced by the T-85 X-wing in the New Republic's defense fleet. The T-85 X-wing made its first appearance in the TV series Star Wars Resistance (2018).\n\n",
    "categories": [
      "Category:Articles with short description",
      "Category:Fictional elements introduced in 1977",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars spacecraft"
    ],
    "pageprops": {
      "defaultsort": "X-Wing",
      "page_image": "X-wing.jpg",
      "wikibase-shortdesc": "Fictional fighter craft",
      "wikibase_item": "Q842127"
    },
    "requested_title": "Porkins' Cockpit",
    "resolved_title": "X-wing fighter"
  },
  {
    "ok": true,
    "title": "Galactic Empire (Star Wars)",
    "pageid": 68430,
    "fullurl": "https://en.wikipedia.org/wiki/Galactic_Empire_(Star_Wars)",
    "extract": "The Galactic Empire, also known simply as the Empire, is a fictional autocracy featured in the Star Wars franchise. Introduced in the 1977 film Star Wars, it is the main antagonistic faction of the original trilogy, which also includes The Empire Strikes Back (1980) and Return of the Jedi (1983). An oppressive dictatorship with a complicated bureaucracy, the Galactic Empire seeks the rule and social control of every planet and civilization within the galaxy, based on anthropocentrism, nationalisation, state terrorism, power projection, and threat of lethal force.\nThe Galactic Empire's rise was not a violent takeover by force, but rather a consolidating unprecedented and unchecked power in the Chancellor via a calculated Gleichschaltung-like dismantling of the galaxy's most powerful institutions by undermining the public's faith in these institutions, rewriting constitutional foundations, controlling the Jedi Council, weakening the Galactic Senate, court packing the Supreme Court and the appointment of loyal Governors. At its peak, the Galactic Empire sprawls over much of the known Star Wars galaxy, which consists of millions of habitable star systems and billions more fringe colonies, shipyards, fortress worlds, and outer territories. The Empire's origins are depicted in the prequel film Revenge of the Sith (2005), where it replaces the Galactic Republic at the end of the Clone Wars orchestrated by the Republic's Supreme Chancellor, Palpatine. Palpatine is also secretly the Sith Lord Darth Sidious, who masterminds the war to destroy the Jedi and restore the Sith to power.\nPalpatine falsely accuses the Jedi of causing the secessionist Clone Wars to weaken the Republic and gain political power. He manipulates the Galactic Senate into using clone troopers created during the conflict to purge the Jedi. After engineering these threats, Palpatine reorganizes the Republic into a state meant to \"ensure the security and continuing stability, and a safe and secure society\": the Galactic Empire, with himself as Emperor ad infinitum. The Senate overwhelmingly supports this decision and lauds his apparent resolve, bravery, and selflessness.\nWith Emperor Palpatine keeping mostly to the shadows, his Sith apprentice, commander-in-chief Darth Vader maintains a more public presence and leads the Imperial forces, acting as a national personification of the Galactic Empire's power. By the time of Episode IV – A New Hope, the faction has transformed into a fully autocratic regime, though it is opposed by the insurgent Alliance to Restore the Republic. The completion of the Death Star, a planet-destroying battle station, allows Emperor Palpatine to instigate a self-coup, dissolving the Imperial Senate and transferring power to Praetor-officers called Imperial Moffs, such as Grand Moff Tarkin.\nThe Galactic Empire collapses after the events of Return of the Jedi. Its remnants form the First Order in the sequel trilogy, set 30 years later.\n\n",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles containing German-language text",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from February 2020",
      "Category:Autocracy",
      "Category:CS1 errors: ISBN",
      "Category:Commons category link is on Wikidata",
      "Category:Fictional elements introduced in 1977",
      "Category:Fictional totalitarian states",
      "Category:Film supervillains",
      "Category:Galactic empires",
      "Category:Short description is different from Wikidata",
      "Category:Sith",
      "Category:Star Wars governments",
      "Category:Villains in animated television series",
      "Category:Webarchive template wayback links",
      "Category:Wikipedia articles needing page number citations from January 2019"
    ],
    "pageprops": {
      "displaytitle": "Galactic Empire (<i>Star Wars</i>)",
      "page_image_free": "Emblem_of_the_First_Galactic_Empire.svg",
      "toc": "",
      "wikibase-shortdesc": "Fictional state in the Star Wars franchise",
      "wikibase_item": "Q52347"
    },
    "requested_title": "Power Station",
    "resolved_title": "Galactic Empire (Star Wars)"
  },
  {
    "ok": true,
    "title": "List of Star Wars creatures",
    "pageid": 1531560,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_creatures",
    "extract": "The universe of Star Wars, a space opera media franchise, features a broad variety of different alien creatures. These aliens can be sentient or non-sentient, serving as species for characters, setting pieces, plot devices, and background elements. The diversity of alien species in Star Wars is considered to be a strong point of the franchise. The creatures are designed to be believable, recognizable, and often endearing—in this way, many creatures from Star Wars have become well known in popular culture.\nThe types of creatures in this list are listed by category and then in alphabetical order.",
    "categories": [
      "Category:All Wikipedia articles written in American English",
      "Category:All articles needing additional references",
      "Category:All articles needing rewrite",
      "Category:All articles that are excessively detailed",
      "Category:All articles with style issues",
      "Category:All articles with unsourced statements",
      "Category:Articles needing additional references from December 2024",
      "Category:Articles with multiple maintenance issues",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from April 2018",
      "Category:Articles with unsourced statements from August 2012",
      "Category:Articles with unsourced statements from July 2016",
      "Category:Articles with unsourced statements from March 2019",
      "Category:Articles with unsourced statements from September 2020",
      "Category:Lists of fictional animals by work",
      "Category:Lists of fictional animals in animation",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars character lists",
      "Category:Star Wars lists",
      "Category:Star Wars species",
      "Category:Use American English from December 2022",
      "Category:Use mdy dates from December 2022",
      "Category:Wikipedia articles needing rewrite from December 2024",
      "Category:Wikipedia articles that are excessively detailed from December 2024",
      "Category:Wikipedia articles with style issues from December 2024"
    ],
    "pageprops": {
      "displaytitle": "List of <i>Star Wars</i> creatures",
      "notoc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q7498272"
    },
    "requested_title": "Rancor Pit",
    "resolved_title": "List of Star Wars creatures"
  },
  {
    "ok": true,
    "title": "Universe of Star Wars",
    "pageid": 79982081,
    "fullurl": "https://en.wikipedia.org/wiki/Universe_of_Star_Wars",
    "extract": "The Star Wars multimedia and film franchise is set in a fictional universe, most events of which occur in a single galaxy in that universe. Originally established by George Lucas as a \"galaxy far, far away\", it comprises numerous planets, moons, star systems, and species. The galaxy is divided into four broad sub-regions: the Core Worlds, Mid Rim, Outer Rim, and Unknown Regions. Notable planets include Coruscant, an ecumenopolis in the Core that functions as a political and cultural center, and Tatooine, a desert planet located in the Outer Rim. The universe initially encompassed a collection of works recognized as canon by Lucasfilm as part of the official Star Wars storyline. Subsequent expanded material in other media was later rebranded as the Legends universe by Disney, declaring it non-canonical to the official universe.\nWithin this fictional body exists a variety of intelligent species, including Humans, Twi’leks, Wookiees, Rodians, and Hutts, as well as several major governing bodies throughout galactic history, such as the Galactic Republic, Galactic Empire, Rebel Alliance, New Republic, and First Order. Each of these entities operates under differing political structures, ranging from democratic institutions to totalitarian regimes. Interstellar travel is facilitated by hyperspace, allowing rapid movement between distant star systems. A central metaphysical concept in the Star Wars universe is the Force, an omnipresent energy field that connects all living things. The Force is divided into two principal aspects: the Light Side, traditionally followed by the Jedi Order, and the Dark Side, embraced by the Sith. The universe also features a high level of technological advancement, including starships, droids, and energy-based weapons such as blasters and lightsabers. The timeline of in-universe events is often measured in reference to the Battle of Yavin, a pivotal conflict depicted in the original 1977 film, serving as a chronological anchor for subsequent developments in the franchise.",
    "categories": [
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:CS1 maint: bot: original URL status unknown",
      "Category:Fictional universes",
      "Category:Harv and Sfn no-target errors",
      "Category:Lucasfilm",
      "Category:Mass media franchises introduced in 1977",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Science fiction franchises",
      "Category:Short description is different from Wikidata",
      "Category:Space opera",
      "Category:Star Wars"
    ],
    "pageprops": {
      "displaytitle": "Universe of <i>Star Wars</i>",
      "page_image_free": "Star_Wars_in_Tunisia_-_Lars_Homestead_in_Chott_el_Djerid_(cropped).jpg",
      "wikibase-shortdesc": "Fictional universe of a media franchise",
      "wikibase_item": "Q19786052"
    },
    "requested_title": "Rebel Base",
    "resolved_title": "Universe of Star Wars"
  },
  {
    "ok": true,
    "title": "Star Wars: A Galactic Spectacular",
    "pageid": 49498551,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_A_Galactic_Spectacular",
    "extract": "Star Wars: A Galactic Spectacular (also known as Star Wars: A Galactic Celebration) was a nighttime show at Disney's Hollywood Studios in Walt Disney World. The show is based on the Star Wars film series and features fireworks, projection mapping, fire, lasers, fog effects, and searchlights. During the show, Star Wars imagery is projected onto the park's Chinese Theater facade and surrounding buildings around the park's hub on Hollywood Boulevard. The show had its celebrity-filled World Premiere on Friday, June 17, 2016, replacing the park's similarly-themed display, Symphony in the Stars: A Galactic Spectacular.\nA second incarnation of the show debuted at Walt Disney Studios Park in Disneyland Paris on January 14, 2017, where the imagery is projected onto The Twilight Zone Tower of Terror on Production Courtyard. It was shown seasonally during the \"Season of the Force\".",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Amusement park attractions introduced in 2017",
      "Category:Amusement park attractions that closed in 2020",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from June 2016",
      "Category:Attractions based on Star Wars",
      "Category:Closed amusement attractions",
      "Category:Disney's Hollywood Studios",
      "Category:Hollywood Boulevard (Disney's Hollywood Studios)",
      "Category:Pages using gadget WikiMiniAtlas",
      "Category:Short description is different from Wikidata",
      "Category:Use mdy dates from October 2024",
      "Category:Walt Disney Parks and Resorts fireworks",
      "Category:Walt Disney Studios Park"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: A Galactic Spectacular</i>",
      "page_image_free": "Star_Wars,_A_Galactic_Spectacular_fireworks.jpg",
      "wikibase-shortdesc": "Fireworks and multimedia show",
      "wikibase_item": "Q22912864"
    },
    "requested_title": "Rebel Blockade Runner",
    "resolved_title": "Star Wars: A Galactic Spectacular"
  },
  {
    "ok": true,
    "title": "Star Wars: Galactic Battlegrounds",
    "pageid": 1085317,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Galactic_Battlegrounds",
    "extract": "Star Wars: Galactic Battlegrounds is a real-time strategy video game set in the Star Wars universe. It was developed by LucasArts and Ensemble Studios. It was released in November 2001. An expansion pack, Clone Campaigns, was released on May 14, 2002, adding two new factions and campaigns. Later that year, both Galactic Battlegrounds and Clone Campaigns were released in a box set, Star Wars: Galactic Battlegrounds Saga.\nThe games were built on the Genie engine by Ensemble Studios, the same one used in Age of Empires and Age of Empires II.",
    "categories": [
      "Category:2001 video games",
      "Category:All articles needing additional references",
      "Category:Articles needing additional references from February 2008",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Aspyr games",
      "Category:CS1 maint: bot: original URL status unknown",
      "Category:Classic Mac OS games",
      "Category:Genie Engine games",
      "Category:LucasArts games",
      "Category:MacOS games",
      "Category:Multiplayer and single-player video games",
      "Category:Real-time strategy video games",
      "Category:Short description matches Wikidata",
      "Category:Star Wars video games",
      "Category:Video games developed in the United States",
      "Category:Windows games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: Galactic Battlegrounds</i>",
      "page_image": "Swgbbox.jpg",
      "wikibase-shortdesc": "2001 video game",
      "wikibase_item": "Q1194920"
    },
    "requested_title": "Rebel Star Cruiser",
    "resolved_title": "Star Wars: Galactic Battlegrounds"
  },
  {
    "ok": true,
    "title": "Universe of Star Wars",
    "pageid": 79982081,
    "fullurl": "https://en.wikipedia.org/wiki/Universe_of_Star_Wars",
    "extract": "The Star Wars multimedia and film franchise is set in a fictional universe, most events of which occur in a single galaxy in that universe. Originally established by George Lucas as a \"galaxy far, far away\", it comprises numerous planets, moons, star systems, and species. The galaxy is divided into four broad sub-regions: the Core Worlds, Mid Rim, Outer Rim, and Unknown Regions. Notable planets include Coruscant, an ecumenopolis in the Core that functions as a political and cultural center, and Tatooine, a desert planet located in the Outer Rim. The universe initially encompassed a collection of works recognized as canon by Lucasfilm as part of the official Star Wars storyline. Subsequent expanded material in other media was later rebranded as the Legends universe by Disney, declaring it non-canonical to the official universe.\nWithin this fictional body exists a variety of intelligent species, including Humans, Twi’leks, Wookiees, Rodians, and Hutts, as well as several major governing bodies throughout galactic history, such as the Galactic Republic, Galactic Empire, Rebel Alliance, New Republic, and First Order. Each of these entities operates under differing political structures, ranging from democratic institutions to totalitarian regimes. Interstellar travel is facilitated by hyperspace, allowing rapid movement between distant star systems. A central metaphysical concept in the Star Wars universe is the Force, an omnipresent energy field that connects all living things. The Force is divided into two principal aspects: the Light Side, traditionally followed by the Jedi Order, and the Dark Side, embraced by the Sith. The universe also features a high level of technological advancement, including starships, droids, and energy-based weapons such as blasters and lightsabers. The timeline of in-universe events is often measured in reference to the Battle of Yavin, a pivotal conflict depicted in the original 1977 film, serving as a chronological anchor for subsequent developments in the franchise.",
    "categories": [
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:CS1 maint: bot: original URL status unknown",
      "Category:Fictional universes",
      "Category:Harv and Sfn no-target errors",
      "Category:Lucasfilm",
      "Category:Mass media franchises introduced in 1977",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Science fiction franchises",
      "Category:Short description is different from Wikidata",
      "Category:Space opera",
      "Category:Star Wars"
    ],
    "pageprops": {
      "displaytitle": "Universe of <i>Star Wars</i>",
      "page_image_free": "Star_Wars_in_Tunisia_-_Lars_Homestead_in_Chott_el_Djerid_(cropped).jpg",
      "wikibase-shortdesc": "Fictional universe of a media franchise",
      "wikibase_item": "Q19786052"
    },
    "requested_title": "Red Leader Starship",
    "resolved_title": "Universe of Star Wars"
  },
  {
    "ok": true,
    "title": "Solo: A Star Wars Story",
    "pageid": 52193417,
    "fullurl": "https://en.wikipedia.org/wiki/Solo:_A_Star_Wars_Story",
    "extract": "Solo: A Star Wars Story is a 2018 American space Western film directed by Ron Howard and written by Jonathan and Lawrence Kasdan. Produced by Lucasfilm Ltd., and distributed by Walt Disney Studios Motion Pictures, it is the second Star Wars anthology film, following Rogue One (2016). The film stars Alden Ehrenreich as Han Solo, with Woody Harrelson, Emilia Clarke, Donald Glover, Thandiwe Newton, Phoebe Waller-Bridge, Joonas Suotamo, and Paul Bettany in supporting roles. The film tells the origin story of Han Solo and Chewbacca, who join a heist within the criminal underworld ten years prior to the events of the first Star Wars film (1977).\nGeorge Lucas began developing a Han Solo prequel in 2012 and commissioned Lawrence Kasdan to write the screenplay. After Lucas sold Lucasfilm to The Walt Disney Company in 2012, Kasdan was hired to write The Force Awakens (2015), leaving his son Jonathan to complete the Solo script. Principal photography began in January 2017 at Pinewood Studios, with directors Phil Lord and Christopher Miller. Both were fired in June 2017 following creative differences with Lucasfilm, and Howard was hired as their replacement. Solo is one of the most expensive films ever made, with a budget of at least $275 million.\nSolo premiered in Los Angeles on May 10, 2018, and was released in North America on May 25. The film received generally positive reviews from critics, which praised the cast (particularly Ehrenreich and Glover), visuals, score, and action sequences, while some criticized the storyline and screenplay. It was the first Star Wars film to be a Box-office bomb, grossing $393 million worldwide. It received a nomination for Best Visual Effects at the 91st Academy Awards.",
    "categories": [
      "Category:2010s American films",
      "Category:2010s English-language films",
      "Category:2010s Western (genre) science fiction films",
      "Category:2010s heist films",
      "Category:2010s science fantasy films",
      "Category:2018 3D films",
      "Category:2018 Western (genre) films",
      "Category:2018 films",
      "Category:2018 science fiction action films",
      "Category:All Wikipedia articles written in American English",
      "Category:American 3D films",
      "Category:American IMAX films",
      "Category:American Western (genre) science fiction films",
      "Category:American action adventure films",
      "Category:American heist films",
      "Category:American prequel films",
      "Category:American science fantasy films",
      "Category:American science fiction action films",
      "Category:American sequel films",
      "Category:Articles with short description",
      "Category:CS1 Italian-language sources (it)",
      "Category:English-language Western (genre) films",
      "Category:English-language action adventure films",
      "Category:English-language crime films",
      "Category:English-language science fiction action films",
      "Category:Film spinoffs",
      "Category:Films about aviators",
      "Category:Films about deserters",
      "Category:Films about orphans",
      "Category:Films directed by Ron Howard",
      "Category:Films produced by Kathleen Kennedy",
      "Category:Films scored by John Powell",
      "Category:Films shot at Pinewood Studios",
      "Category:Films shot in Italy",
      "Category:Films shot in the Canary Islands",
      "Category:Films using motion capture",
      "Category:Films with screenplays by Jonathan Kasdan",
      "Category:Films with screenplays by Lawrence Kasdan",
      "Category:Good articles",
      "Category:Interquel films",
      "Category:Lucasfilm films",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Short description is different from Wikidata",
      "Category:Space Western films",
      "Category:Star Wars spinoff films",
      "Category:Template film date with 2 release dates",
      "Category:The Numbers ID different from Wikidata",
      "Category:Use American English from August 2019",
      "Category:Use mdy dates from August 2019",
      "Category:Works by Jonathan Kasdan"
    ],
    "pageprops": {
      "displaytitle": "<i>Solo: A Star Wars Story</i>",
      "page_image": "Solo_A_Star_Wars_Story_poster.jpg",
      "toc": "",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "2018 film by Ron Howard",
      "wikibase_item": "Q27038847"
    },
    "requested_title": "Red Ten's Cockpit",
    "resolved_title": "Solo: A Star Wars Story"
  },
  {
    "ok": false,
    "requested_title": "Ridge",
    "resolved_title": "Park Ridge, Illinois",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": true,
    "title": "Star Wars: The Old Republic",
    "pageid": 19879390,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_The_Old_Republic",
    "extract": "Star Wars: The Old Republic is a massively multiplayer online role-playing game (MMORPG) based in the Star Wars fictional universe. Developed by BioWare Austin and a supplemental team at BioWare Edmonton, the game was announced on October 21, 2008. The video game was released for the Microsoft Windows platform on December 20, 2011 in North America and part of Europe. It was released in Oceania and Asia on March 1, 2012.\nThis story takes place in the Star Wars universe shortly after the establishment of a tenuous peace between the re-emergent Sith Empire and the Galactic Republic. The game features eight different classes. Each of the eight classes has a three act storyline that progresses as the character levels up. Players join either the Republic or the Sith, but players may possess a morality at any point along the light/dark spectrum. Different classes favor different styles of gameplay, and the game features extensive customization options, fully voiced dialogue, companion characters, and dialogue options similar to BioWare's other role-playing games.\nAlthough not officially disclosed, based on estimates, it is one of the most developmentally expensive games made. The game had one million subscribers within three days of its launch, making it the world's \"fastest-growing MMO ever\"; however, in the following months the game lost a fair share of its subscriptions, but has remained profitable. The game has since adopted the hybrid free-to-play business model with remaining subscription option. The game was met with positive reception upon release and has received several updates and expansion packs. Several books and comics based on the game have been released. It is estimated that the game made $139 million in additional revenues on top of the subscription income in 2013. In an earnings call to investors in October 2019, Electronic Arts announced that Star Wars: The Old Republic was closing in on a billion dollars in lifetime revenue, making it a financial success based on the reported $200 million development budget.\n\n",
    "categories": [
      "Category:2011 video games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:BioWare games",
      "Category:Free-to-play video games",
      "Category:LucasArts games",
      "Category:MacOS games",
      "Category:Massively multiplayer online role-playing games",
      "Category:Science fiction massively multiplayer online role-playing games",
      "Category:Short description matches Wikidata",
      "Category:Space opera video games",
      "Category:Star Wars: Knights of the Old Republic",
      "Category:Star Wars video games",
      "Category:Use mdy dates from January 2016",
      "Category:Video games developed in the United States",
      "Category:Video games scored by Jason Graves",
      "Category:Video games scored by Lennie Moore",
      "Category:Video games scored by Mark Griskey",
      "Category:Windows-only games",
      "Category:Windows games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: The Old Republic</i>",
      "page_image": "Star_Wars-_The_Old_Republic_cover.jpg",
      "wikibase-shortdesc": "2011 video game",
      "wikibase_item": "Q737308"
    },
    "requested_title": "Road To Jabba's Palace",
    "resolved_title": "Star Wars: The Old Republic"
  },
  {
    "ok": true,
    "title": "List of Star Wars air, aquatic, and ground vehicles",
    "pageid": 3938702,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_air,_aquatic,_and_ground_vehicles",
    "extract": "The following is a list of fictional Star Wars terrestrial vehicles, including armored fighting vehicles, military aircraft, and naval ships.\nThe Star Wars universe showcases a diversity of vehicle types, many of which utilize fictitious technology.  One of these, the repulsorlift, is an anti-gravity device that pushes against a planet's gravity to create lift.  Vehicles which use repulsorlifts to hover and fly are known as 'repulsorcraft' or 'speeders' with further classifications including airspeeders, landspeeders, snowspeeders and speeder bikes.  Traditional methods of locomotion like wheels and tracked treads still see use however as they are typically more durable and require less energy to operate.  Walkers are a special type of ground vehicle which propel themselves on mechanical legs and are used as armored cavalry on the battlefield.\n\n",
    "categories": [
      "Category:All Wikipedia articles written in American English",
      "Category:Articles with short description",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars lists",
      "Category:Star Wars vehicles",
      "Category:Use American English from June 2023",
      "Category:Use mdy dates from June 2018",
      "Category:Wikipedia indefinitely semi-protected pages"
    ],
    "pageprops": {
      "defaultsort": "Air, Aquatic, And Ground Vehicles",
      "displaytitle": "List of <i>Star Wars</i> air, aquatic, and ground vehicles",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q4412312"
    },
    "requested_title": "Sail Barge",
    "resolved_title": "List of Star Wars air, aquatic, and ground vehicles"
  },
  {
    "ok": true,
    "title": "Sandcrawler",
    "pageid": 601681,
    "fullurl": "https://en.wikipedia.org/wiki/Sandcrawler",
    "extract": "The sandcrawler is a fictional transport vehicle in the Star Wars universe that is found on the desert planet Tatooine. The vehicle, as it appears in its major appearances in Star Wars Episode IV: A New Hope, is 37 metres (121 ft) long and 18 metres (59 ft) tall. Only a 27-metre (89 ft) length of its lower hull was constructed as a set for the film. Other appearances were simulated with matte paintings and a remote-controlled model.",
    "categories": [
      "Category:Articles with short description",
      "Category:CS1 maint: location missing publisher",
      "Category:CS1 maint: multiple names: authors list",
      "Category:Fictional elements introduced in 1977",
      "Category:Fictional fortifications",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars vehicles"
    ],
    "pageprops": {
      "page_image": "Star_Wars_Sandcrawler.png",
      "wikibase-shortdesc": "Type of vehicle in the Star Wars universe",
      "wikibase_item": "Q19876"
    },
    "requested_title": "Sandcrawler",
    "resolved_title": "Sandcrawler"
  },
  {
    "ok": false,
    "requested_title": "Scout Campsite",
    "resolved_title": "Scouting in West Midlands",
    "error": {
      "code": "resolved_but_not_starwars_enough"
    }
  },
  {
    "ok": true,
    "title": "List of Star Wars air, aquatic, and ground vehicles",
    "pageid": 3938702,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_air,_aquatic,_and_ground_vehicles",
    "extract": "The following is a list of fictional Star Wars terrestrial vehicles, including armored fighting vehicles, military aircraft, and naval ships.\nThe Star Wars universe showcases a diversity of vehicle types, many of which utilize fictitious technology.  One of these, the repulsorlift, is an anti-gravity device that pushes against a planet's gravity to create lift.  Vehicles which use repulsorlifts to hover and fly are known as 'repulsorcraft' or 'speeders' with further classifications including airspeeders, landspeeders, snowspeeders and speeder bikes.  Traditional methods of locomotion like wheels and tracked treads still see use however as they are typically more durable and require less energy to operate.  Walkers are a special type of ground vehicle which propel themselves on mechanical legs and are used as armored cavalry on the battlefield.\n\n",
    "categories": [
      "Category:All Wikipedia articles written in American English",
      "Category:Articles with short description",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars lists",
      "Category:Star Wars vehicles",
      "Category:Use American English from June 2023",
      "Category:Use mdy dates from June 2018",
      "Category:Wikipedia indefinitely semi-protected pages"
    ],
    "pageprops": {
      "defaultsort": "Air, Aquatic, And Ground Vehicles",
      "displaytitle": "List of <i>Star Wars</i> air, aquatic, and ground vehicles",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q4412312"
    },
    "requested_title": "Skiff",
    "resolved_title": "List of Star Wars air, aquatic, and ground vehicles"
  },
  {
    "ok": true,
    "title": "Star Wars video games",
    "pageid": 1750228,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_video_games",
    "extract": "Over one hundred video games based on the Star Wars franchise have been released, dating back to some of the earliest home consoles. Some are based directly on films while others rely heavily on the Star Wars Expanded Universe.\nStar Wars games have gone through three significant development eras: early licensed games (1979–1993), games developed after the creation of LucasArts (1993–2013), and games created after the closure of LucasArts (2014–present), which are currently licensed to Electronic Arts, and include an EA Star Wars logo.\nThe first Star Wars games were developed by a variety of companies after Star Wars creator George Lucas licensed the rights to Star Wars video games; several of these games were released under the Lucasfilm Games banner. Early licensed games, released during the 8-bit and 16-bit eras of gaming, barely featured any kind of narrative, and many were action titles that either retold the stories of the original trilogy (1977–1983) or focused on a single scene of a film.\nLater on, Lucas took interest in the increasing success of the video game market, and decided to create his own video game development company, LucasArts, so he could have more creative control over the games and their narratives. During this era, graphics evolved enough for games to be able to tell complex narratives, leading to games that featured more advanced retellings of the stories of the films, with voice-overs and CGI cut scenes, as well as original titles with new narratives that were set in the same continuity as the films. After The Walt Disney Company's purchase of Lucasfilm in 2012 and the closure of LucasArts the following year, the games developed during the first two eras were discarded from the canon in 2014 and reassigned to the non-canonical Star Wars Legends label.\nFollowing LucasArts' closure, the rights to produce Star Wars video games were reassigned solely to Electronic Arts. Games published during this era are considered canonical to the franchise, and have featured more influence from the Lucasfilm Story Group, responsible for managing aspects of Star Wars canon. The EA Star Wars license had been set to expire in 2023, but in 2021, Lucasarts announced new partnerships for others to produce Star Wars and other Lucasfilm games alongside Electronic Arts.\nAlthough many hobbyists and independent game developers have created freeware games based on the Star Wars movie series and brand, this page lists only the games that have been developed or published by LucasArts, or officially licensed by Lucasfilm.\nAs of 2020, there have been over 90 million copies of Star Wars games sold.\n\n",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from August 2019",
      "Category:Articles with unsourced statements from December 2023",
      "Category:CS1: unfit URL",
      "Category:CS1 errors: generic name",
      "Category:Pages containing links to subscription-only content",
      "Category:Short description is different from Wikidata",
      "Category:Short description matches Wikidata",
      "Category:Star Wars video games",
      "Category:Subscription required using via",
      "Category:Use dmy dates from February 2025"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i> video games",
      "page_image_free": "Star_wars2.svg",
      "wikibase-shortdesc": "Video games based on the Star Wars franchise",
      "wikibase_item": "Q54300"
    },
    "requested_title": "Snowspeeder",
    "resolved_title": "Star Wars video games"
  },
  {
    "ok": true,
    "title": "Star Wars Hyperspace Mountain",
    "pageid": 12996382,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Hyperspace_Mountain",
    "extract": "Star Wars: Hyperspace Mountain (formerly known as Space Mountain: Mission 2 and Space Mountain: De la terre à la lune) is an indoor/outdoor steel roller coaster in Discoveryland at Disneyland Paris. Originally themed around Jules Verne's classic 1865 novel From the Earth to the Moon, the attraction first opened on June 1, 1995, three years after the park's debut in an attempt to draw more guests to the financially unstable European resort. Unlike other Space Mountain attractions at Disney theme parks, the installation at Disneyland Paris had a steampunk-detailed appearance with a Columbiad Cannon and a plate-and-rivet exterior under its previous theme. It is the only Space Mountain to feature inversions, a launch, a section of track that exits and re-enters the interior, and a synchronized on-Board audio track. It is by far the largest Space Mountain installation at any Disney theme park.\nThe original Space Mountain: De la Terre à la Lune closed on January 15, 2005, and later reopened as Space Mountain: Mission 2. This version of the ride used the same track layout, but without the Jules Verne theme. A refurbishment took place in 2015 to improve the special effects and overall presentation. The newest renovation to the ride implements a Star Wars theme to celebrate the resort's 25th anniversary.",
    "categories": [
      "Category:2017 establishments in France",
      "Category:All articles needing additional references",
      "Category:Amusement rides based on works by Jules Verne",
      "Category:Amusement rides introduced in 2017",
      "Category:Articles needing additional references from July 2015",
      "Category:Articles with short description",
      "Category:Attractions based on Star Wars",
      "Category:Coordinates on Wikidata",
      "Category:Disneyland Park (Paris)",
      "Category:Enclosed roller coasters",
      "Category:Launched roller coasters",
      "Category:Operating roller coasters",
      "Category:Outer space in amusement parks",
      "Category:Pages using gadget WikiMiniAtlas",
      "Category:Roller coasters at Disneyland Park (Paris)",
      "Category:Roller coasters manufactured by Vekoma",
      "Category:Short description is different from Wikidata",
      "Category:Space Mountain",
      "Category:Steampunk",
      "Category:Steel roller coasters",
      "Category:Tomorrowland (Disney Parks)",
      "Category:Walt Disney Parks and Resorts attractions",
      "Category:Works based on From the Earth to the Moon"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i> Hyperspace Mountain",
      "page_image_free": "Space_Mountain_Mission_2.jpg",
      "wikibase-shortdesc": "Roller coaster at Disneyland Paris",
      "wikibase_item": "Q507026"
    },
    "requested_title": "Space",
    "resolved_title": "Star Wars Hyperspace Mountain"
  },
  {
    "ok": true,
    "title": "Star Cruiser",
    "pageid": 77139108,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Cruiser",
    "extract": "A star cruiser or starcruiser is a common spaceship designation in some science fiction and science fantasy media.\nStar cruiser or starcruiser may also refer to:\n\nStar Cruiser (1980 video game), developed by Strategems Co. for the TRS-80 Model I Level II\nStar Cruiser (1988 video game), developed by Arsys Software for the PC-8801 and X1 computers\nStar Wars: Galactic Starcruiser, space travel themed hotel experience at Walt Disney World from 2022 to 2023",
    "categories": [
      "Category:All article disambiguation pages",
      "Category:All disambiguation pages",
      "Category:Disambiguation pages",
      "Category:Short description is different from Wikidata"
    ],
    "pageprops": {
      "disambiguation": "",
      "wikibase-shortdesc": "Topics referred to by the same term",
      "wikibase_item": "Q126547534"
    },
    "requested_title": "Star Cruiser",
    "resolved_title": "Star Cruiser"
  },
  {
    "ok": true,
    "title": "Star Destroyer",
    "pageid": 50790,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Destroyer",
    "extract": "Star Destroyers are capital ships in the fictional Star Wars universe. Star Destroyers were produced by Kuat Drive Yards, later Kuat-Entralla Engineering, and serve as \"the signature vessel of the fleet\" for the Galactic Republic, Galactic Empire, the First Order, and the Sith Eternal in numerous published works including film, television, novels, comics, and video games.\nA single Star Destroyer could project considerable influence over a star system in the name of the Empire: each can be deployed individually as both a forward operating base and as mobile weapon systems platform responsible for safeguarding multiple planets, trade routes, and systems, and carried enough firepower to subdue an entire planetary system or annihilate a small rebel fleet.\nNotable examples of Star Destroyers include the precursor Venator-class Star Destroyer (prequel trilogy), the ubiquitous Imperial-class Star Destroyer (original trilogy), and the recent Resurgent-class and Xyston-class Star Destroyer (sequel trilogy). Numerous other classes of \"Star Destroyers\" share the basic triangular \"dagger\" hull; the successful v-shaped designs are explained in Legends as reflecting the Empire's \"Tarkin's Doctrine\" military philosophy and originating from Sith ideological influence, and have been adapted by numerous factions for a wide variety of applications.\nNumerous Star Destroyer models and toys have been released. The iconic scene in Star Wars (1977) featuring the Imperial Star Destroyer's first appearance where it pursues a Corellian corvette has been called a milestone in special effects history.\n\n",
    "categories": [
      "Category:Articles with short description",
      "Category:Fictional elements introduced in 1977",
      "Category:Fictional military vehicles",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars spacecraft"
    ],
    "pageprops": {
      "wikibase-shortdesc": "Large armed Imperial starships that are often the centerpiece of attacks on rebels",
      "wikibase_item": "Q19913"
    },
    "requested_title": "Star Destroyer",
    "resolved_title": "Star Destroyer"
  },
  {
    "ok": true,
    "title": "Star Wars Tales",
    "pageid": 3774939,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_Tales",
    "extract": "Star Wars Tales is a comic book series published by Dark Horse Comics, beginning on September 29, 1999, and completing its run on July 13, 2005. Each issue is 64 pages and features a few unrelated stories from various eras of the Star Wars timeline. Stories from issues #1–20 were retroactively labelled \"Infinities\", placing them outside the Star Wars canon, while those of issues #21–24 were considered to be within continuity, unless labelled otherwise. References to the stories were made within the Expanded Universe, the entirety of which was deemed non-canon by Lucasfilm in 2014.\nThe entire series was collected into six trade paperbacks, comprising four issues each.\n\n",
    "categories": [
      "Category:All articles needing additional references",
      "Category:Articles needing additional references from June 2023",
      "Category:Articles with short description",
      "Category:Comics anthologies",
      "Category:Comics based on Star Wars",
      "Category:Dark Horse Comics titles",
      "Category:Ewoks",
      "Category:Short description is different from Wikidata",
      "Category:Use mdy dates from May 2021"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars Tales</i>",
      "page_image": "Star_Wars_Tales_01.jpg",
      "toc": "",
      "wikibase-shortdesc": "Comic book series published by Dark Horse Comics, 1999-2005",
      "wikibase_item": "Q979484"
    },
    "requested_title": "Star Destroyer, Avenger",
    "resolved_title": "Star Wars Tales"
  },
  {
    "ok": true,
    "title": "Star Wars: X-wing (book series)",
    "pageid": 2573090,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_X-wing_(book_series)",
    "extract": "Star Wars: X-wing is a ten-book series of Star Wars novels by Michael A. Stackpole (who also co-wrote the similarly named comic book series) and Aaron Allston. Stackpole's contributions cover the adventures of a new Rogue Squadron formed by Wedge Antilles, while Allston's focus on Antilles' Wraith Squadron.\n\n",
    "categories": [
      "Category:Articles with short description",
      "Category:Book series introduced in 1996",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars Legends novels"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: X-wing</i> (book series)",
      "page_image": "XWRogueSquadron1.jpg",
      "wikibase-shortdesc": "Book series",
      "wikibase_item": "Q3236196"
    },
    "requested_title": "Super Star Destroyer",
    "resolved_title": "Star Wars: X-wing (book series)"
  },
  {
    "ok": true,
    "title": "Tatooine",
    "pageid": 77861,
    "fullurl": "https://en.wikipedia.org/wiki/Tatooine",
    "extract": "Tatooine ( tat-oo-EEN) is a fictional desert planet that appears in the Star Wars franchise. It is a beige-colored, desolate world orbiting a pair of binary stars, and inhabited by human settlers and a variety of other life-forms. The planet was first seen in the original 1977 film Star Wars, and has to date featured in a total of seven Star Wars theatrical films, three live-action television series, and four animated series.\nIt is the home planet of the protagonist of the original Star Wars Trilogy, Luke Skywalker, and of his father, Anakin Skywalker (who later became Darth Vader). It is also the planet where Obi-Wan Kenobi takes up residence under the name \"Ben Kenobi\" in order to watch over Luke during the former's exile following the events of Order 66 and Anakin's fall to the dark side. Shots of the binary sunset over the Tatooine desert are considered to be an iconic image of the film series, along with the greatest sunset scenes in cinematic history.",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:All articles with vague or ambiguous time",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from September 2019",
      "Category:Commons category link from Wikidata",
      "Category:Fiction set on desert planets",
      "Category:Fictional elements introduced in 1977",
      "Category:Fictional planets",
      "Category:Science and technology articles needing translation from French Wikipedia",
      "Category:Short description matches Wikidata",
      "Category:Star Wars planets",
      "Category:Use mdy dates from July 2020",
      "Category:Vague or ambiguous time from August 2025",
      "Category:Wikipedia articles needing page number citations from January 2019"
    ],
    "pageprops": {
      "page_image": "Tatooine_(fictional_desert_planet).jpg",
      "wikibase-shortdesc": "Fictional planet in the Star Wars universe",
      "wikibase_item": "Q723764"
    },
    "requested_title": "Tatooine",
    "resolved_title": "Tatooine"
  },
  {
    "ok": true,
    "title": "Star Wars: A Galactic Spectacular",
    "pageid": 49498551,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_A_Galactic_Spectacular",
    "extract": "Star Wars: A Galactic Spectacular (also known as Star Wars: A Galactic Celebration) was a nighttime show at Disney's Hollywood Studios in Walt Disney World. The show is based on the Star Wars film series and features fireworks, projection mapping, fire, lasers, fog effects, and searchlights. During the show, Star Wars imagery is projected onto the park's Chinese Theater facade and surrounding buildings around the park's hub on Hollywood Boulevard. The show had its celebrity-filled World Premiere on Friday, June 17, 2016, replacing the park's similarly-themed display, Symphony in the Stars: A Galactic Spectacular.\nA second incarnation of the show debuted at Walt Disney Studios Park in Disneyland Paris on January 14, 2017, where the imagery is projected onto The Twilight Zone Tower of Terror on Production Courtyard. It was shown seasonally during the \"Season of the Force\".",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Amusement park attractions introduced in 2017",
      "Category:Amusement park attractions that closed in 2020",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from June 2016",
      "Category:Attractions based on Star Wars",
      "Category:Closed amusement attractions",
      "Category:Disney's Hollywood Studios",
      "Category:Hollywood Boulevard (Disney's Hollywood Studios)",
      "Category:Pages using gadget WikiMiniAtlas",
      "Category:Short description is different from Wikidata",
      "Category:Use mdy dates from October 2024",
      "Category:Walt Disney Parks and Resorts fireworks",
      "Category:Walt Disney Studios Park"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: A Galactic Spectacular</i>",
      "page_image_free": "Star_Wars,_A_Galactic_Spectacular_fireworks.jpg",
      "wikibase-shortdesc": "Fireworks and multimedia show",
      "wikibase_item": "Q22912864"
    },
    "requested_title": "Throne Room",
    "resolved_title": "Star Wars: A Galactic Spectacular"
  },
  {
    "ok": true,
    "title": "List of Star Wars spacecraft",
    "pageid": 4042821,
    "fullurl": "https://en.wikipedia.org/wiki/List_of_Star_Wars_spacecraft",
    "extract": "The following is a list of starships, cruisers, battleships, and other spacecraft in the Star Wars films, books, and video games.\nWithin the fictional universe of the Star Wars setting, there are a wide variety of different spacecraft defined by their role and type. Among the many civilian spacecraft are cargo freighters, passenger transports, diplomatic couriers, personal shuttles and escape pods. Warships likewise come in many shapes and sizes, from small patrol ships and troop transports to large capital ships like Star Destroyers and other battleships. Starfighters also feature prominently in the setting.\nMany fictional technologies are incorporated into Star Wars starships, fantastical devices developed over the millennia of the setting's history. Hyperdrives provides for faster-than-light travel between stars at instantaneous speeds, though traveling uncharted routes can be dangerous. Sublight engines allow spacecraft to get clear of a planet's gravitational well in minutes and travel interplanetary distances easily. For travel within planetary atmospheres or for taking off and landing, anti-gravity devices known as repulsorlifts are used. Other gravity-manipulation technologies include tractor beams to grab onto objects and acceleration compensators to protect passengers from high g-forces. Protective barriers called deflector shields defend against threats, while many ships carry different types of weaponry.\n\n",
    "categories": [
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from October 2020",
      "Category:Articles with unsourced statements from September 2025",
      "Category:Commons category link is locally defined",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars lists",
      "Category:Star Wars spacecraft"
    ],
    "pageprops": {
      "defaultsort": "Spacecraft",
      "displaytitle": "List of <i>Star Wars</i> spacecraft",
      "toc": "",
      "wikibase-shortdesc": "",
      "wikibase_item": "Q3255153"
    },
    "requested_title": "Upper Deck",
    "resolved_title": "List of Star Wars spacecraft"
  },
  {
    "ok": true,
    "title": "Star Wars (comic strip)",
    "pageid": 60487081,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars_(comic_strip)",
    "extract": "A Star Wars comic strip ran in both daily strips and Sunday strips, originally distributed between 1979 and 1984 by two American newspaper publishers, the Los Angeles Times Syndicate and Watertown Daily Times.\nThe comics are set between the original Star Wars film and The Empire Strikes Back, with the exception of an adaptation of Brian Daley's Han Solo at Stars' End (1979). The first run, by Russ Manning, was primarily created before the release of The Empire Strikes Back, while Archie Goodwin and Al Williamson, in their storylines, worked with the benefit of having seen both films, in addition to Return of the Jedi in 1983.\nIn 1991, Russ Cochran published a 2500-copy limited run of a three-volume hardcover boxset of all of Goodwin and Williamson's Star Wars comic strips from between 1981 and 1984. From 1992 to 1994, Dark Horse Comics collected colorized compilations of the newspaper strip in its Classic Star Wars series. Between 2017 and 2018, The Library of American Comics and IDW Publishing published a three-volume reprint series of the complete comic strip.\n\n",
    "categories": [
      "Category:1979 comics debuts",
      "Category:1984 comics endings",
      "Category:2017 comics debuts",
      "Category:2018 comics endings",
      "Category:Comic strip collection books",
      "Category:Comics based on Star Wars",
      "Category:Comics based on films",
      "Category:Comics by Archie Goodwin (comics)",
      "Category:Eisner Award winners",
      "Category:Marvel Comics titles",
      "Category:Science fiction comic strips",
      "Category:The Library of American Comics publications",
      "Category:Use mdy dates from July 2020"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars</i> (comic strip)",
      "page_image": "Star_Wars_-_The_Complete_Classic_Newspaper_Comics,_Vol._1.jpg",
      "wikibase_item": "Q65056788"
    },
    "requested_title": "Vader's Star Destroyer",
    "resolved_title": "Star Wars (comic strip)"
  },
  {
    "ok": true,
    "title": "Star Wars: From the Adventures of Luke Skywalker",
    "pageid": 4936526,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_From_the_Adventures_of_Luke_Skywalker",
    "extract": "Star Wars: From the Adventures of Luke Skywalker is the novelization of the 1977 film Star Wars, ghostwritten by American author Alan Dean Foster, but credited to director George Lucas. It was first published on November 12, 1976, by Ballantine Books, several months before the release of the film. In later years, it was republished under the title Star Wars: A New Hope to reflect the retroactive addition of a subtitle to the film in 1981.\nThe prologue includes references to Palpatine and his rise to power, setting up the backstory for future films. The book also contains some differences from the film.",
    "categories": [
      "Category:1976 American novels",
      "Category:1976 science fiction novels",
      "Category:All articles with unsourced statements",
      "Category:Articles with short description",
      "Category:Articles with unsourced statements from May 2020",
      "Category:Ballantine Books books",
      "Category:Novels based on films",
      "Category:Novels by Alan Dean Foster",
      "Category:Novels set in deserts",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars (film)",
      "Category:Star Wars novels",
      "Category:Use mdy dates from December 2015"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: From The Adventures Of Luke Skywalker",
      "displaytitle": "<i>Star Wars: From the Adventures of Luke Skywalker</i>",
      "page_image": "StarWarsNovelization.jpg",
      "wikibase-shortdesc": "1976 novel by Alan Dean Foster",
      "wikibase_item": "Q6272668"
    },
    "requested_title": "Wedge's Cockpit",
    "resolved_title": "Star Wars: From the Adventures of Luke Skywalker"
  },
  {
    "ok": true,
    "title": "Star Wars: The Rise of Skywalker",
    "pageid": 43910733,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_The_Rise_of_Skywalker",
    "extract": "Star Wars: The Rise of Skywalker (also known as Star Wars: Episode IX – The Rise of Skywalker) is a 2019 American epic space opera film produced, co-written, and directed by J. J. Abrams. Produced by Lucasfilm and Bad Robot, and distributed by Walt Disney Studios Motion Pictures, it is the third installment of the Star Wars sequel trilogy, following The Force Awakens (2015) and The Last Jedi (2017), and the final episode of the nine-part \"Skywalker saga\". Its cast includes Carrie Fisher, Mark Hamill, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Anthony Daniels, Naomi Ackie, Domhnall Gleeson, Richard E. Grant, Lupita Nyong'o, Keri Russell, Joonas Suotamo, Kelly Marie Tran, Ian McDiarmid, and Billy Dee Williams. The film follows Rey, Finn, and Poe Dameron as they lead the remnants of the Resistance in a final stand against Supreme Leader Kylo Ren and the First Order, who are now allied by the resurrected Sith Lord, Emperor Palpatine, Rey's paternal grandfather.\nFollowing initial reports that The Last Jedi director Rian Johnson would write the script for Episode IX, in August 2015, Colin Trevorrow was hired to direct and to write a script with his collaborator Derek Connolly; both ultimately retain story credit with Abrams and Chris Terrio. In September 2017, Trevorrow left the project following creative differences with producer Kathleen Kennedy, and Abrams returned as director. John Williams, composer for the previous episodic films, returned to compose the score, making it his final score for the franchise. Principal photography began in August 2018 at Pinewood Studios in England and wrapped in February 2019, with post-production completed in November 2019. With a net budget of approximately $489.9 million, it is the most expensive film ever made.\nThe Rise of Skywalker premiered in Hollywood, Los Angeles, on December 16, 2019, and was released in the United States on December 20. The film received mixed reviews from critics, and grossed $1.077 billion, making it the seventh-highest-grossing film of 2019, but the lowest-grossing of the trilogy. It received three nominations at the 92nd Academy Awards (Best Original Score, Best Visual Effects, and Best Sound Editing) as well as three at the 73rd British Academy Film Awards (also Best Special Visual Effects, Best Original Music, and Best Sound). It won five awards at the 46th Saturn Awards, including Best Science Fiction Film.\n\n",
    "categories": [
      "Category:2010s American films",
      "Category:2010s English-language films",
      "Category:2010s science fantasy films",
      "Category:2019 3D films",
      "Category:2019 LGBTQ-related films",
      "Category:2019 films",
      "Category:2019 science fiction action films",
      "Category:4DX films",
      "Category:All Wikipedia articles written in American English",
      "Category:All articles with style issues",
      "Category:American 3D films",
      "Category:American IMAX films",
      "Category:American LGBTQ-related films",
      "Category:American epic fantasy films",
      "Category:American films about revenge",
      "Category:American science fantasy films",
      "Category:American science fiction action films",
      "Category:American science fiction war films",
      "Category:American sequel films",
      "Category:Articles with short description",
      "Category:Bad Robot Productions films",
      "Category:CS1: unfit URL",
      "Category:Censored films",
      "Category:Disney and LGBTQ",
      "Category:English-language science fiction action films",
      "Category:Films about resurrection",
      "Category:Films directed by J. J. Abrams",
      "Category:Films produced by J. J. Abrams",
      "Category:Films produced by Kathleen Kennedy",
      "Category:Films scored by John Williams",
      "Category:Films shot at Pinewood Studios",
      "Category:Films shot in Buckinghamshire",
      "Category:Films shot in England",
      "Category:Films shot in Jordan",
      "Category:Films using motion capture",
      "Category:Films with archival recordings",
      "Category:Films with screenplays by Chris Terrio",
      "Category:Films with screenplays by Colin Trevorrow",
      "Category:Films with screenplays by Derek Connolly",
      "Category:Films with screenplays by J. J. Abrams",
      "Category:Good articles",
      "Category:IMDb ID (Cite Mojo) different from Wikidata",
      "Category:Lucasfilm films",
      "Category:Official website different in Wikidata and Wikipedia",
      "Category:Pages using Sister project links with hidden wikidata",
      "Category:Saturn Award–winning films",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars Skywalker Saga films",
      "Category:Template film date with 2 release dates",
      "Category:Use American English from October 2025",
      "Category:Use mdy dates from October 2025",
      "Category:Wikipedia articles with style issues from September 2023",
      "Category:Wikipedia indefinitely move-protected pages"
    ],
    "pageprops": {
      "defaultsort": "Star Wars: The Rise of Skywalker",
      "displaytitle": "<i>Star Wars: The Rise of Skywalker</i>",
      "page_image": "Star_Wars_The_Rise_of_Skywalker_poster.jpg",
      "toc": "",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "2019 film by J. J. Abrams",
      "wikibase_item": "Q20977110"
    },
    "requested_title": "Wedge's Fighter",
    "resolved_title": "Star Wars: The Rise of Skywalker"
  },
  {
    "ok": true,
    "title": "Star Wars: Rogue Squadron",
    "pageid": 4419938,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Rogue_Squadron",
    "extract": "Star Wars: Rogue Squadron or Star Wars: Rogue Squadron 3D is an arcade-style flight action game co-developed by Factor 5 and LucasArts. The first of the Rogue Squadron trilogy, it was published by LucasArts and Nintendo and released for Microsoft Windows and Nintendo 64 in December 1998. The game's story was influenced by the Star Wars: X-wing – Rogue Squadron comics and is set in the fictional Star Wars galaxy, taking place primarily between events in the films Star Wars and The Empire Strikes Back. The player controls Luke Skywalker, commander of the elite X-wing pilots known as Rogue Squadron. As the game progresses, Skywalker and Rogue Squadron fight the Galactic Empire in 16 missions across various planets.\nGameplay is presented from the third-person perspective, although the player can switch to first person if they prefer. The game's objectives are divided into four categories: search and destroy, reconnaissance, rescue, and protect. The player can control up to five standard craft, with an additional two unlockable bonus craft on PC version, and three on 64 version. Each offers a unique armament arrangement, as well as varying degrees of speed and maneuverability. Bonus power-ups that improve these craft's weapons or durability are hidden in different levels throughout the game. After each level, the player's performance is checked against three medal benchmarks. Acquiring these medals promotes the player's rank and helps unlock hidden content.\nRogue Squadron's focus on flight combat was directly inspired by a level in Star Wars: Shadows of the Empire that allowed the player to pilot a snowspeeder. Working together during development, Factor 5 designed the game engine, the music, and worked closely with Nintendo, while LucasArts produced the game's story and gameplay and ensured it was faithful to Star Wars canon. Before the game's release, Factor 5 appealed to Nintendo to commercially release the Nintendo 64's newly developed memory Expansion Pak. Consequently, Rogue Squadron was one of the first games to take advantage of the Expansion Pak, which allows gameplay at a higher display resolution.\nUpon release, critics praised the game's technical achievements and flight controls, but its use of distance fog and the lack of a multiplayer mode drew criticism. The game's sales exceeded expectations; by August 1999, more than one million copies had been sold worldwide. It spawned two sequels developed and released for the GameCube—Star Wars Rogue Squadron II: Rogue Leader and Star Wars Rogue Squadron III: Rebel Strike—as well as Star Wars Episode I: Battle for Naboo, a spiritual successor released for Windows and Nintendo 64.",
    "categories": [
      "Category:1998 video games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in multiple platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:CS1: unfit URL",
      "Category:CS1 maint: numeric names: authors list",
      "Category:Factor 5 games",
      "Category:Featured articles",
      "Category:Nintendo 64 games",
      "Category:Nintendo games",
      "Category:Origins Award winners",
      "Category:Short description matches Wikidata",
      "Category:Single-player video games",
      "Category:Star Wars: Rogue Squadron games",
      "Category:Use mdy dates from May 2022",
      "Category:Video games developed in the United States",
      "Category:Video games scored by Chris Huelsbeck",
      "Category:Windows games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: Rogue Squadron</i>",
      "page_image": "Star-wars-rogue-squadron.jpg",
      "wikibase-badge-Q17437796": "",
      "wikibase-shortdesc": "1998 video game",
      "wikibase_item": "Q54297"
    },
    "requested_title": "Wedge's Snowspeeder, Rogue Three",
    "resolved_title": "Star Wars: Rogue Squadron"
  },
  {
    "ok": true,
    "title": "Star Wars: Squadrons",
    "pageid": 64262611,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Squadrons",
    "extract": "Star Wars: Squadrons is a space combat game set in the Star Wars universe, developed by Motive Studio and published by Electronic Arts. It was released for PlayStation 4, Windows, and Xbox One, on October 2, 2020, and for Xbox Series X/S on December 3, 2020. The game features both multiplayer game modes and a single-player campaign. Set after Return of the Jedi, the campaign alternates between the New Republic's Vanguard Squadron and the Galactic Empire's Titan Squadron, both of which become involved with the Republic's Project Starhawk; Vanguard Squadron wants to ensure its completion, while Titan Squadron attempts to destroy it.\nThe game received generally favorable reviews upon release, garnering praise for its gameplay, while facing some criticism over its story and lack of content. The game sold more than 1.1 million digital copies as of October 2020.\n\n",
    "categories": [
      "Category:2020 video games",
      "Category:Action games",
      "Category:Articles using Infobox video game using locally defined parameters",
      "Category:Articles using Video game reviews template in single platform mode",
      "Category:Articles using Wikidata infoboxes with locally defined images",
      "Category:Articles with short description",
      "Category:Electronic Arts games",
      "Category:Frostbite (game engine) games",
      "Category:Motive Studio games",
      "Category:Multiplayer and single-player video games",
      "Category:PlayStation 4 games",
      "Category:Short description is different from Wikidata",
      "Category:Space combat simulators",
      "Category:Space opera video games",
      "Category:Star Wars video games",
      "Category:Use mdy dates from December 2020",
      "Category:Video games developed in Canada",
      "Category:Video games set in outer space",
      "Category:Virtual reality games",
      "Category:Windows games",
      "Category:Xbox One games"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: Squadrons</i>",
      "page_image": "Star_Wars_Squadrons.jpg",
      "wikibase-shortdesc": "2020 video game",
      "wikibase_item": "Q96312725"
    },
    "requested_title": "Wingman's Cockpit",
    "resolved_title": "Star Wars: Squadrons"
  },
  {
    "ok": true,
    "title": "Star Wars: X-wing (book series)",
    "pageid": 2573090,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_X-wing_(book_series)",
    "extract": "Star Wars: X-wing is a ten-book series of Star Wars novels by Michael A. Stackpole (who also co-wrote the similarly named comic book series) and Aaron Allston. Stackpole's contributions cover the adventures of a new Rogue Squadron formed by Wedge Antilles, while Allston's focus on Antilles' Wraith Squadron.\n\n",
    "categories": [
      "Category:Articles with short description",
      "Category:Book series introduced in 1996",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars Legends novels"
    ],
    "pageprops": {
      "displaytitle": "<i>Star Wars: X-wing</i> (book series)",
      "page_image": "XWRogueSquadron1.jpg",
      "wikibase-shortdesc": "Book series",
      "wikibase_item": "Q3236196"
    },
    "requested_title": "X-Wing",
    "resolved_title": "Star Wars: X-wing (book series)"
  },
  {
    "ok": true,
    "title": "X-wing fighter",
    "pageid": 50801,
    "fullurl": "https://en.wikipedia.org/wiki/X-wing_fighter",
    "extract": "The X-wing starfighter is a name applied to a family of fictional spacecraft manufactured by the Incom Corporation and later the Incom-FreiTek Corporation from the Star Wars franchise. Named for the distinctive shape made when its s-foils (wings) are in attack position, the X-wing was a class of starfighter used by the Rebel Alliance in their conflict with the Galactic Empire. It made its theatrical debut, as the T-65B model, in Star Wars (1977) as the spacecraft piloted by Luke Skywalker and the Red Squadron when Luke destroyed the Death Star. The starfighter featured extensively in the Star Wars original trilogy and in the Expanded Universe that followed, and has been merchandised as a variety of toys and models.\nStarting with The Force Awakens (2015), a new model of X-wing was introduced, which has gone on to play a prominent role in the Star Wars sequel trilogy. The T-70 X-wing, flown by the Resistance in their fight against the First Order, is depicted as the successor to the T-65. Although described as being an improvement over the original, in the expanded literature this new X-wing is itself considered outdated, having been replaced by the T-85 X-wing in the New Republic's defense fleet. The T-85 X-wing made its first appearance in the TV series Star Wars Resistance (2018).\n\n",
    "categories": [
      "Category:Articles with short description",
      "Category:Fictional elements introduced in 1977",
      "Category:Pages using multiple image with auto scaled images",
      "Category:Short description is different from Wikidata",
      "Category:Star Wars spacecraft"
    ],
    "pageprops": {
      "defaultsort": "X-Wing",
      "page_image": "X-wing.jpg",
      "wikibase-shortdesc": "Fictional fighter craft",
      "wikibase_item": "Q842127"
    },
    "requested_title": "X-Wing Fighter",
    "resolved_title": "X-wing fighter"
  },
  {
    "ok": true,
    "title": "Star Wars: Duel of the Fates",
    "pageid": 67449470,
    "fullurl": "https://en.wikipedia.org/wiki/Star_Wars:_Duel_of_the_Fates",
    "extract": "Star Wars: Duel of the Fates (also known as Star Wars: Episode IX – Duel of the Fates) is a 2016 screenplay written by Colin Trevorrow and Derek Connolly. It was intended as the third entry of the Star Wars sequel trilogy and the sequel to Star Wars: The Last Jedi (2017). It takes its title from a musical piece written by John Williams for Star Wars: Episode I – The Phantom Menace (1999). \nTrevorrow was announced as the director of Episode IX in 2015. After producing several drafts of a screenplay, Trevorrow was removed from the project, with Lucasfilm citing the reason as \"creative differences\". The third in the trilogy was released in December 2019 as Star Wars: The Rise of Skywalker. While Trevorrow retained a story credit on the final release, it was directed by J. J. Abrams and co-written by Abrams with Chris Terrio. In January 2020, Trevorrow's script was posted to social media, with some critics describing the work as too professional to be fan fiction. Following the release of early concept art from the film, Trevorrow confirmed the script's authenticity.\nThe script was positively received. Some journalists compared the draft positively to the released film, describing it as a more faithful sequel to The Last Jedi. Series actor John Boyega expressed enthusiasm regarding the leaked concept art, but avoided reading the script to avoid \"heartbreak\". Several fan-made adaptations were produced.",
    "categories": [
      "Category:Articles with short description",
      "Category:Films with screenplays by Derek Connolly",
      "Category:Good articles",
      "Category:Short description matches Wikidata",
      "Category:Star Wars",
      "Category:Unproduced screenplays",
      "Category:Use mdy dates from January 2022",
      "Category:Works by Colin Trevorrow"
    ],
    "pageprops": {
      "defaultsort": "Star Wars:Duel of the Fates",
      "displaytitle": "<i>Star Wars: Duel of the Fates</i>",
      "page_image_free": "Colin_Treverow_(cropped).jpg",
      "wikibase-badge-Q17437798": "",
      "wikibase-shortdesc": "Unproduced film script",
      "wikibase_item": "Q107695033"
    },
    "requested_title": "Yoda's House",
    "resolved_title": "Star Wars: Duel of the Fates"
  },
  {
    "ok": false,
    "requested_title": "Zev's Snowspeeder, Rogue Two",
    "error": {
      "code": "no_starwars_match"
    }
  }
]